BGzEroll/foc_v3p_esp32/user_lib/drivers/foc/esp32_hardware_test.cpp
#include "esp32_hardware_test.h"

#include "foc_core.h"
#include "drivers/bus/i2c_bus.h"
#include "driver/gpio.h"
#include "driver/mcpwm_cmpr.h"
#include "driver/mcpwm_gen.h"
#include "driver/mcpwm_oper.h"
#include "driver/mcpwm_timer.h"
#include "esp_adc/adc_cali_scheme.h"
#include "esp_adc/adc_continuous.h"
#include "esp_adc/adc_oneshot.h"
#include "esp_attr.h"
#include "esp_cpu.h"
#include "esp_err.h"
#include "esp_ipc.h"
#include "esp_log.h"
#include "esp_rom_sys.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "soc/gpio_struct.h"
#include "soc/soc_caps.h"
#include <atomic>
#include <cstdint>

/* ---- 硬件引脚和测试参数 ---- */

static const char *TAG = "esp32_foc_test";

static constexpr gpio_num_t ENABLE_PIN = GPIO_NUM_12;
static constexpr gpio_num_t CURRENT_A_PIN = GPIO_NUM_39;
static constexpr gpio_num_t CURRENT_B_PIN = GPIO_NUM_36;
static constexpr gpio_num_t BUS_SENSE_PIN = GPIO_NUM_4;
static constexpr gpio_num_t PWM_A_PIN = GPIO_NUM_32;
static constexpr gpio_num_t PWM_B_PIN = GPIO_NUM_33;
static constexpr gpio_num_t PWM_C_PIN = GPIO_NUM_25;
static constexpr gpio_num_t ENCODER_SDA_PIN = GPIO_NUM_19;
static constexpr gpio_num_t ENCODER_SCL_PIN = GPIO_NUM_18;

static constexpr uint8_t AS5600_ADDRESS = 0x36;
static constexpr uint8_t AS5600_RAW_ANGLE_REGISTER = 0x0C;
static constexpr uint32_t I2C_SPEED_HZ = 400000;
static constexpr bool I2C_ENABLE_INTERNAL_PULLUP = true;
static constexpr uint32_t ENCODER_READ_RETRY_COUNT = 2;
static constexpr uint32_t ENCODER_RETRY_DELAY_MS = 1;

static constexpr int PWM_GROUP_ID = 0;
static constexpr uint32_t PWM_FREQUENCY_HZ = 10000;
static constexpr uint32_t PWM_RESOLUTION_HZ = 10000000;
static constexpr uint32_t PWM_PERIOD_TICKS =
    PWM_RESOLUTION_HZ / PWM_FREQUENCY_HZ;
static constexpr gpio_num_t PWM_PINS[] = {
    PWM_A_PIN,
    PWM_B_PIN,
    PWM_C_PIN
};

static constexpr adc_channel_t CURRENT_A_CHANNEL = ADC_CHANNEL_3;
static constexpr adc_channel_t CURRENT_B_CHANNEL = ADC_CHANNEL_0;
static constexpr adc_channel_t BUS_SENSE_CHANNEL = ADC_CHANNEL_0;
static constexpr adc_atten_t ADC_ATTENUATION = ADC_ATTEN_DB_12;
static constexpr adc_bitwidth_t ADC_BITWIDTH = ADC_BITWIDTH_DEFAULT;
static constexpr float ADC_RAW_TO_MV = 3300.0f / 4095.0f;
static constexpr uint32_t CURRENT_ADC_SAMPLE_FREQ_HZ = 40000;
static constexpr uint32_t CURRENT_ADC_FRAME_SIZE = 64;
static constexpr BaseType_t CURRENT_ADC_TASK_CORE = 0;
static constexpr UBaseType_t CURRENT_ADC_TASK_PRIORITY =
    tskIDLE_PRIORITY + 3;
static constexpr UBaseType_t CONTROL_TASK_PRIORITY =
    tskIDLE_PRIORITY + 4;

static constexpr float PI = 3.14159265358979323846f;
static constexpr float TWO_PI = 6.28318530717958647692f;
static constexpr float RAD_PER_SECOND_TO_RPM = 60.0f / TWO_PI;
static constexpr float SQRT_THREE_OVER_TWO = 0.86602540378443864676f;

static constexpr uint8_t MOTOR_POLE_PAIRS = 7;
static constexpr int8_t MOTOR_ROTOR_DIRECTION = 1;
static constexpr float MOTOR_BUS_VOLTAGE_V = 12.0f;
static constexpr float MOTOR_VOLTAGE_LIMIT_V = 4.0f;
static constexpr float MOTOR_MAX_PHASE_CURRENT_A = 0.2f;
static constexpr uint32_t FOC_CONTROL_FREQUENCY_HZ = PWM_FREQUENCY_HZ;
static constexpr uint32_t FOC_CONTROL_PERIOD_US =
    1000000 / FOC_CONTROL_FREQUENCY_HZ;
static constexpr uint32_t CONTROL_TIMER_RESOLUTION_HZ = PWM_RESOLUTION_HZ;
static constexpr float FOC_CONTROL_PERIOD_S =
    static_cast<float>(FOC_CONTROL_PERIOD_US) * 1.0e-6f;
static constexpr float SPEED_CONTROL_PERIOD_S = 0.001f;
static constexpr float CURRENT_PI_KP = 0.54f;
static constexpr float CURRENT_PI_KI = 400.0f;
static constexpr float CURRENT_PI_INTEGRAL_LIMIT_V = 1.0f;

static constexpr float CLOSED_LOOP_TARGET_MECHANICAL_SPEED_RAD_S = 5.0f;
static constexpr float CLOSED_LOOP_SPEED_RAMP_RAD_S2 = 20.0f;
static constexpr float CLOSED_LOOP_MAX_Q_CURRENT_A = 0.05f;
static constexpr float SPEED_PI_KP_A_PER_RAD_S = 0.01f;
static constexpr float SPEED_PI_KI_A_PER_RAD_S2 = 0.005f;
static constexpr float SPEED_PI_INTEGRAL_LIMIT_A = 0.003f;
static constexpr float MOTOR_MAX_MECHANICAL_SPEED_RAD_S = 30.0f;
// 允许采样瞬时速度高于保护阈值，用于过滤明显错误的角度跳变。
static constexpr float ENCODER_MAX_SAMPLE_SPEED_RAD_S = 120.0f;
static constexpr uint32_t SPEED_OVERSPEED_CONFIRMATION_COUNT = 3;
static constexpr uint32_t SPEED_LOG_WINDOW_MAX_US = 2000000;
// 降低速度反馈权重，减少 AS5600 速度量化和采样抖动传入速度环。
static constexpr float SPEED_FILTER_ALPHA = 0.05f;
static constexpr uint32_t VELOCITY_ESTIMATION_PERIOD_US = 20000;
static constexpr float STARTUP_KICK_Q_CURRENT_A = 0.05f;
static constexpr uint32_t STARTUP_KICK_DURATION_MS = 100;
static constexpr uint32_t CONTROL_TARGET_HANDOFF_DELAY_MS = 10;

static constexpr float CURRENT_SHUNT_RESISTOR_OHM = 0.01f;
static constexpr float CURRENT_AMPLIFIER_GAIN = 50.0f;
static constexpr float CURRENT_SENSE_SIGN = -1.0f;
static constexpr float CURRENT_SCALE_A_PER_MV =
    1.0f / CURRENT_SHUNT_RESISTOR_OHM /
        CURRENT_AMPLIFIER_GAIN / 1000.0f;

static constexpr uint32_t CURRENT_OFFSET_SAMPLE_COUNT = 1000;
static constexpr uint32_t CURRENT_SAMPLE_COUNT = 5;
static constexpr uint32_t CURRENT_SAMPLE_SPACING_US = 6;
static constexpr uint32_t CURRENT_SAMPLE_TIMEOUT_US = 5000;
static constexpr float ALIGNMENT_VOLTAGE_V = 0.4f;
static constexpr float ALIGNMENT_MAX_PHASE_CURRENT_A = 0.35f;
static constexpr uint32_t ALIGNMENT_DURATION_MS = 500;
static constexpr uint32_t AUTO_START_DELAY_MS = 1000;
static constexpr uint32_t TEST_RUN_DURATION_MS = 60000;
static constexpr uint32_t CONTROL_TASK_PERIOD_MS = 1;
static constexpr BaseType_t CONTROL_ISR_CORE = 1;
static constexpr BaseType_t CONTROL_TASK_CORE = 0;
static constexpr uint32_t LOG_PERIOD_MS = 500;

/* ---- 硬件运行状态 ---- */

static foc_core motor;
static i2c_bus encoder_bus(I2C_NUM_0,
    ENCODER_SDA_PIN,
    ENCODER_SCL_PIN,
    I2C_ENABLE_INTERNAL_PULLUP);
static i2c_device encoder_device(encoder_bus,
    AS5600_ADDRESS,
    I2C_SPEED_HZ);

static adc_continuous_handle_t adc1_continuous = nullptr;
static adc_oneshot_unit_handle_t adc2_unit = nullptr;
static adc_cali_handle_t adc2_calibration = nullptr;

static bool pwm_initialized = false;
static bool bus_sense_available = false;
static bool module_initialized = false;
static volatile DRAM_ATTR uint32_t current_raw_packed = 0;
static volatile DRAM_ATTR uint32_t current_raw_version = 0;
static volatile DRAM_ATTR uint32_t current_raw_sequence = 0;
static volatile DRAM_ATTR uint32_t current_adc_frame_count = 0;
static volatile DRAM_ATTR uint32_t current_adc_read_error_count = 0;
static volatile DRAM_ATTR uint32_t current_adc_last_frame_size = 0;
static volatile DRAM_ATTR uint32_t current_adc_last_sample_count = 0;
static volatile DRAM_ATTR uint32_t current_adc_last_a_count = 0;
static volatile DRAM_ATTR uint32_t current_adc_last_b_count = 0;
static volatile DRAM_ATTR uint32_t current_adc_last_invalid_count = 0;
static volatile DRAM_ATTR uint32_t current_adc_commit_count = 0;
static volatile DRAM_ATTR uint32_t current_adc_last_commit_sequence = 0;
static volatile DRAM_ATTR uint32_t current_adc_last_commit_timestamp_us = 0;
static volatile DRAM_ATTR uint32_t current_adc_update_count = 0;
static volatile DRAM_ATTR uint32_t current_adc_no_pair_count = 0;
static volatile DRAM_ATTR uint32_t current_adc_update_stage = 0;
static volatile DRAM_ATTR uint32_t current_adc_dma_callback_count = 0;
static volatile DRAM_ATTR uint8_t current_adc_dma_core_id = 0xff;
static volatile DRAM_ATTR uint32_t current_adc_dma_last_timestamp_us = 0;
static volatile DRAM_ATTR uint32_t current_adc_start_frame_count = 0;
static volatile DRAM_ATTR uint32_t current_adc_start_update_count = 0;
static volatile DRAM_ATTR uint32_t current_adc_start_dma_callback_count = 0;
static float current_offset_a_mv = 0.0f;
static float current_offset_b_mv = 0.0f;
static bool encoder_tracking_valid = false;
static float encoder_previous_angle_rad = 0.0f;
static float encoder_unwrapped_angle_rad = 0.0f;
static int64_t encoder_previous_timestamp_us = 0;
static bool encoder_velocity_reference_valid = false;
static float encoder_velocity_reference_angle_rad = 0.0f;
static int64_t encoder_velocity_reference_timestamp_us = 0;
static float encoder_velocity_rad_s = 0.0f;
static std::atomic<uint32_t> encoder_rejected_sample_count{0};
static volatile float speed_feedback_for_log_rad_s = 0.0f;
static uint32_t sample_sequence = 0;
static int32_t bus_sense_voltage_mv = 0;
static bool bus_sense_read_valid = false;
static uint32_t bus_sense_last_duration_us = 0;
static uint32_t bus_sense_max_duration_us = 0;
static mcpwm_timer_handle_t control_timer = nullptr;
static mcpwm_oper_handle_t pwm_operators[3] = {};
static mcpwm_cmpr_handle_t pwm_comparators[3] = {};
static mcpwm_gen_handle_t pwm_generators[3] = {};
static bool control_timer_started = false;
static volatile DRAM_ATTR bool control_timer_running = false;
static volatile DRAM_ATTR bool control_isr_in_progress = false;
static volatile DRAM_ATTR bool control_isr_fault = false;
static volatile DRAM_ATTR uint8_t control_isr_last_result =
    static_cast<uint8_t>(foc_result::NOT_READY);
static volatile DRAM_ATTR uint8_t control_isr_fault_result =
    static_cast<uint8_t>(foc_result::NOT_READY);
static volatile DRAM_ATTR uint32_t control_isr_tick_count = 0;
static volatile DRAM_ATTR uint32_t control_isr_last_timestamp_us = 0;
static volatile DRAM_ATTR uint32_t control_isr_last_cycles = 0;
static volatile DRAM_ATTR uint32_t control_isr_max_cycles = 0;
static volatile DRAM_ATTR uint8_t control_isr_core_id = 0xff;
static volatile DRAM_ATTR esp_err_t control_timer_initialize_result = ESP_FAIL;
static volatile DRAM_ATTR uint32_t control_isr_fault_timestamp_us = 0;
static volatile DRAM_ATTR uint32_t control_isr_fault_current_age_us = 0;
static volatile DRAM_ATTR uint32_t control_isr_fault_raw_sequence = 0;
static volatile DRAM_ATTR uint32_t control_isr_fault_locked_sequence = 0;
static volatile DRAM_ATTR uint32_t control_isr_fault_unlocked_sequence = 0;
static volatile DRAM_ATTR uint32_t control_isr_fault_sample_count = 0;
static volatile DRAM_ATTR uint32_t control_isr_fault_a_count = 0;
static volatile DRAM_ATTR uint32_t control_isr_fault_b_count = 0;
static volatile DRAM_ATTR uint32_t control_isr_fault_invalid_count = 0;
static volatile DRAM_ATTR uint32_t control_isr_fault_commit_count = 0;
static volatile DRAM_ATTR uint32_t control_isr_fault_commit_sequence = 0;
static volatile DRAM_ATTR uint32_t control_isr_fault_commit_age_us = 0;
static volatile DRAM_ATTR uint32_t control_isr_fault_update_count = 0;
static volatile DRAM_ATTR uint32_t control_isr_fault_no_pair_count = 0;
static volatile DRAM_ATTR uint32_t control_isr_fault_update_stage = 0;
static volatile DRAM_ATTR uint32_t control_isr_fault_dma_callback_count = 0;
static volatile DRAM_ATTR uint8_t control_isr_fault_dma_core_id = 0xff;
static volatile DRAM_ATTR uint32_t control_isr_fault_dma_age_us = 0;
static volatile DRAM_ATTR uint32_t control_isr_fault_frame_delta = 0;
static volatile DRAM_ATTR uint32_t control_isr_fault_update_delta = 0;
static volatile DRAM_ATTR uint32_t control_isr_fault_dma_delta = 0;
static volatile DRAM_ATTR uint32_t control_isr_fault_snapshot_retry_count = 0;
static volatile DRAM_ATTR uint8_t control_isr_fault_rotor_peek_ok = 0;
static volatile DRAM_ATTR uint8_t control_isr_fault_rotor_valid = 0;
static volatile DRAM_ATTR uint32_t control_isr_fault_rotor_age_us = 0;
static volatile DRAM_ATTR uint32_t control_isr_fault_task_iteration_count = 0;
static volatile DRAM_ATTR uint32_t control_isr_fault_task_stage = 0;
static volatile DRAM_ATTR uint32_t control_isr_fault_task_stage_age_us = 0;
static volatile DRAM_ATTR uint32_t current_isr_last_timestamp_us = 0;
static volatile DRAM_ATTR uint32_t current_isr_last_raw_sequence = 0;
static volatile DRAM_ATTR uint32_t current_isr_unlocked_raw_sequence = 0;
static volatile DRAM_ATTR uint16_t current_isr_last_raw_a = 0;
static volatile DRAM_ATTR uint16_t current_isr_last_raw_b = 0;
static volatile DRAM_ATTR uint32_t current_isr_last_good_raw_sequence = 0;
static volatile DRAM_ATTR uint32_t current_isr_snapshot_retry_count = 0;
static foc_topic_access *control_topics = nullptr;
static uint32_t current_isr_sequence = 0;
static uint32_t rotor_read_success_count = 0;
static uint32_t rotor_read_failure_count = 0;
static uint32_t rotor_last_published_timestamp_us = 0;
static uint32_t rotor_publish_count = 0;
static uint32_t rotor_last_publish_interval_us = 0;
static uint32_t rotor_max_publish_interval_us = 0;
static uint32_t encoder_read_attempt_failure_count = 0;
static uint32_t encoder_bus_reset_count = 0;
static uint32_t encoder_last_read_duration_us = 0;
static uint32_t encoder_max_read_duration_us = 0;
static volatile DRAM_ATTR uint32_t control_task_iteration_count = 0;
static volatile DRAM_ATTR uint32_t control_task_stage = 0;
static volatile DRAM_ATTR uint32_t control_task_stage_timestamp_us = 0;

/**
 * @brief 记录 ADC Continuous DMA 转换完成中断的位置
 *
 * @param handle ADC Continuous 句柄
 * @param event_data 转换帧事件数据
 * @param user_data 用户上下文，未使用
 *
 * @return 不请求任务切换
 *
 * @note 该回调只记录诊断信息，不读取 DMA 帧、不解析数据、不打印日志。
 */
static bool IRAM_ATTR adc_conversion_done_callback(
    adc_continuous_handle_t handle,
    const adc_continuous_evt_data_t *event_data,
    void *user_data)
{
    (void)handle;
    (void)event_data;
    (void)user_data;
    uint32_t next_callback_count = current_adc_dma_callback_count;
    current_adc_dma_callback_count = next_callback_count + 1;
    current_adc_dma_core_id = static_cast<uint8_t>(xPortGetCoreID());
    current_adc_dma_last_timestamp_us = static_cast<uint32_t>(
        esp_timer_get_time());
    return false;
}

