BGzEroll/foc_v3p_esp32/user_lib/drivers/foc/esp32_hardware_test.cpp
/* ---- 通用硬件辅助函数 ---- */

/**
 * @brief 计算浮点数绝对值
 *
 * @param value 输入数值
 *
 * @return 绝对值
 */
static float absolute_value(float value)
{
    return value < 0.0f ? -value : value;
}

/**
 * @brief 将数值限制到对称区间
 *
 * @param value 输入数值
 * @param limit 对称区间的绝对值上限
 *
 * @return 限制后的数值
 */
static float clamp_symmetric(float value, float limit)
{
    if(value > limit){return limit;}
    if(value < -limit){return -limit;}
    return value;
}

/**
 * @brief 将角度限制到零至二倍圆周率范围
 *
 * @param angle_rad 输入角度，单位弧度
 *
 * @return 归一化角度，单位弧度
 */
static float normalize_angle(float angle_rad)
{
    while(angle_rad >= TWO_PI)
    {
        angle_rad -= TWO_PI;
    }
    while(angle_rad < 0.0f)
    {
        angle_rad += TWO_PI;
    }
    return angle_rad;
}

/**
 * @brief 根据速度误差计算 q 轴电流目标
 *
 * @param target_speed_rad_s 目标机械速度，单位弧度每秒
 * @param measured_speed_rad_s 反馈机械速度，单位弧度每秒
 * @param integral_a 速度 PI 积分状态，单位安培
 *
 * @return q 轴电流目标，单位安培
 *
 * @note 该速度环位于 foc_core 的电流环之外，只在任务上下文运行。
 */
static float calculate_speed_q_current_target(float target_speed_rad_s,
    float measured_speed_rad_s,
    float &integral_a)
{
    float speed_error_rad_s = target_speed_rad_s - measured_speed_rad_s;
    float integral_candidate_a = integral_a +
        SPEED_PI_KI_A_PER_RAD_S2 * speed_error_rad_s *
            SPEED_CONTROL_PERIOD_S;
    integral_a = clamp_symmetric(integral_candidate_a,
        SPEED_PI_INTEGRAL_LIMIT_A);

    float current_target_a = SPEED_PI_KP_A_PER_RAD_S *
        speed_error_rad_s + integral_a;
    return clamp_symmetric(current_target_a,
        CLOSED_LOOP_MAX_Q_CURRENT_A);
}

/**
 * @brief 释放 MCPWM 三相 PWM 资源
 */
static void deinitialize_power_output()
{
    for(uint32_t index = 0; index < 3; index++)
    {
        if(pwm_generators[index])
        {
            mcpwm_del_generator(pwm_generators[index]);
            pwm_generators[index] = nullptr;
        }
    }
    for(uint32_t index = 0; index < 3; index++)
    {
        if(pwm_comparators[index])
        {
            mcpwm_del_comparator(pwm_comparators[index]);
            pwm_comparators[index] = nullptr;
        }
    }
    for(uint32_t index = 0; index < 3; index++)
    {
        if(pwm_operators[index])
        {
            mcpwm_del_operator(pwm_operators[index]);
            pwm_operators[index] = nullptr;
        }
    }
    if(control_timer)
    {
        mcpwm_del_timer(control_timer);
        control_timer = nullptr;
    }
    pwm_initialized = false;
}

/**
 * @brief 初始化 MCPWM 三相 PWM 和使能 GPIO
 *
 * @return 初始化成功时返回 true
 */
static bool initialize_power_output()
{
    if(pwm_initialized)
    {
        return true;
    }

    esp_err_t error = gpio_set_direction(ENABLE_PIN, GPIO_MODE_OUTPUT);
    if(error != ESP_OK)
    {
        ESP_LOGE(TAG, "配置使能 GPIO 失败: %d", static_cast<int>(error));
        return false;
    }

    error = gpio_set_level(ENABLE_PIN, 0);
    if(error != ESP_OK)
    {
        ESP_LOGE(TAG, "关闭驱动器失败: %d", static_cast<int>(error));
        return false;
    }

    mcpwm_timer_config_t timer_config = {};
    timer_config.group_id = PWM_GROUP_ID;
    timer_config.clk_src = MCPWM_TIMER_CLK_SRC_DEFAULT;
    timer_config.resolution_hz = CONTROL_TIMER_RESOLUTION_HZ;
    timer_config.count_mode = MCPWM_TIMER_COUNT_MODE_UP;
    timer_config.period_ticks = PWM_PERIOD_TICKS;
    // 经典 ESP32 的 FOC ISR 会执行浮点运算，固定使用 Level-1，配合
    // CONFIG_FREERTOS_FPU_IN_ISR，避免由驱动自动选择到不匹配的中断级别。
    timer_config.intr_priority = 1;
    timer_config.flags.allow_pd = false;

    error = mcpwm_new_timer(&timer_config, &control_timer);
    if(error != ESP_OK)
    {
        ESP_LOGE(TAG, "创建 MCPWM 定时器失败: %d", static_cast<int>(error));
        return false;
    }

    mcpwm_operator_config_t operator_config = {};
    operator_config.group_id = PWM_GROUP_ID;
    for(uint32_t index = 0; index < 3; index++)
    {
        error = mcpwm_new_operator(&operator_config,
            &pwm_operators[index]);
        if(error != ESP_OK)
        {
            ESP_LOGE(TAG, "创建 MCPWM operator%lu 失败: %d",
                static_cast<unsigned long>(index),
                static_cast<int>(error));
            deinitialize_power_output();
            return false;
        }

        error = mcpwm_operator_connect_timer(pwm_operators[index],
            control_timer);
        if(error != ESP_OK)
        {
            ESP_LOGE(TAG, "连接 MCPWM operator%lu 失败: %d",
                static_cast<unsigned long>(index),
                static_cast<int>(error));
            deinitialize_power_output();
            return false;
        }
    }

    mcpwm_comparator_config_t comparator_config = {};
    comparator_config.flags.update_cmp_on_tez = true;
    for(uint32_t index = 0; index < 3; index++)
    {
        error = mcpwm_new_comparator(pwm_operators[index],
            &comparator_config,
            &pwm_comparators[index]);
        if(error != ESP_OK)
        {
            ESP_LOGE(TAG, "创建 MCPWM comparator%lu 失败: %d",
                static_cast<unsigned long>(index),
                static_cast<int>(error));
            deinitialize_power_output();
            return false;
        }
    }

    mcpwm_generator_config_t generator_config = {};
    for(uint32_t index = 0; index < 3; index++)
    {
        generator_config.gen_gpio_num = static_cast<int>(PWM_PINS[index]);
        error = mcpwm_new_generator(pwm_operators[index],
            &generator_config,
            &pwm_generators[index]);
        if(error != ESP_OK)
        {
            ESP_LOGE(TAG, "创建 MCPWM generator%lu 失败: %d",
                static_cast<unsigned long>(index),
                static_cast<int>(error));
            deinitialize_power_output();
            return false;
        }

        error = mcpwm_generator_set_action_on_timer_event(
            pwm_generators[index],
            MCPWM_GEN_TIMER_EVENT_ACTION(
                MCPWM_TIMER_DIRECTION_UP,
                MCPWM_TIMER_EVENT_EMPTY,
                MCPWM_GEN_ACTION_HIGH));
        if(error != ESP_OK)
        {
            ESP_LOGE(TAG, "配置 MCPWM generator%lu 周期动作失败: %d",
                static_cast<unsigned long>(index),
                static_cast<int>(error));
            deinitialize_power_output();
            return false;
        }

        error = mcpwm_generator_set_action_on_compare_event(
            pwm_generators[index],
            MCPWM_GEN_COMPARE_EVENT_ACTION(
                MCPWM_TIMER_DIRECTION_UP,
                pwm_comparators[index],
                MCPWM_GEN_ACTION_LOW));
        if(error != ESP_OK)
        {
            ESP_LOGE(TAG, "配置 MCPWM generator%lu 比较动作失败: %d",
                static_cast<unsigned long>(index),
                static_cast<int>(error));
            deinitialize_power_output();
            return false;
        }
    }

    pwm_initialized = true;
    return true;
}

/**
 * @brief 将占空比转换为 MCPWM 比较值
 *
 * @param duty 占空比，范围零至一
 *
 * @return MCPWM 比较计数值
 */
static uint32_t IRAM_ATTR duty_to_counts(float duty)
{
    return static_cast<uint32_t>(duty * PWM_PERIOD_TICKS + 0.5f);
}

/**
 * @brief 向 MCPWM 比较器写入单路占空比
 *
 * @param comparator MCPWM 比较器
 * @param duty 占空比，范围零至一
 *
 * @return 写入结果
 *
 * @note MCPWM 比较值接口同时支持任务和 ISR 上下文；该函数保持在
 *       IRAM 中，供 FOC 控制 ISR 调用。
 */
static foc_result IRAM_ATTR write_pwm_compare(
    mcpwm_cmpr_handle_t comparator,
    float duty)
{
    if(!comparator)
    {
        return foc_result::DRIVER_FAULT;
    }

