BGzEroll/foc_v3p_esp32/user_lib/drivers/foc/esp32_hardware_test.cpp
    esp_err_t error = mcpwm_comparator_set_compare_value(comparator,
        duty_to_counts(duty));
    return error == ESP_OK ? foc_result::OK : foc_result::DRIVER_FAULT;
}

/**
 * @brief 向三相 MCPWM 通道写入占空比
 *
 * @param duty 三相占空比
 *
 * @return 写入结果
 */
static foc_result write_pwm_duty(const phase_duty &duty)
{
    if(!pwm_initialized)
    {
        return foc_result::DRIVER_FAULT;
    }
    if(!(duty.phase_a >= 0.0f && duty.phase_a <= 1.0f) ||
        !(duty.phase_b >= 0.0f && duty.phase_b <= 1.0f) ||
        !(duty.phase_c >= 0.0f && duty.phase_c <= 1.0f))
    {
        return foc_result::OUTPUT_RANGE;
    }

    if(write_pwm_compare(pwm_comparators[0], duty.phase_a) !=
        foc_result::OK)
    {
        return foc_result::DRIVER_FAULT;
    }
    if(write_pwm_compare(pwm_comparators[1], duty.phase_b) !=
        foc_result::OK)
    {
        return foc_result::DRIVER_FAULT;
    }
    if(write_pwm_compare(pwm_comparators[2], duty.phase_c) !=
        foc_result::OK)
    {
        return foc_result::DRIVER_FAULT;
    }
    return foc_result::OK;
}

/**
 * @brief 在 ISR 中更新三相 MCPWM 占空比
 *
 * @param duty 三相占空比
 *
 * @return 写入结果
 *
 * @note MCPWM 比较器值在 TEZ 处更新，三相写入均由 MCPWM 硬件同步输出。
 */
static foc_result IRAM_ATTR write_pwm_duty_from_isr(const phase_duty &duty)
{
    if(!pwm_initialized)
    {
        return foc_result::DRIVER_FAULT;
    }
    if(!(duty.phase_a >= 0.0f && duty.phase_a <= 1.0f) ||
        !(duty.phase_b >= 0.0f && duty.phase_b <= 1.0f) ||
        !(duty.phase_c >= 0.0f && duty.phase_c <= 1.0f))
    {
        return foc_result::OUTPUT_RANGE;
    }

    if(write_pwm_compare(pwm_comparators[0], duty.phase_a) !=
        foc_result::OK)
    {
        return foc_result::DRIVER_FAULT;
    }
    if(write_pwm_compare(pwm_comparators[1], duty.phase_b) !=
        foc_result::OK)
    {
        return foc_result::DRIVER_FAULT;
    }
    if(write_pwm_compare(pwm_comparators[2], duty.phase_c) !=
        foc_result::OK)
    {
        return foc_result::DRIVER_FAULT;
    }
    return foc_result::OK;
}

/**
 * @brief 在 ISR 中直接控制驱动器使能脚
 *
 * @param enabled 是否打开驱动器
 */
static void IRAM_ATTR set_enable_pin_from_isr(bool enabled)
{
    constexpr uint32_t enable_pin_mask =
        1U << static_cast<uint32_t>(ENABLE_PIN);
    if(enabled)
    {
        GPIO.out_w1ts = enable_pin_mask;
    }
    else
    {
        GPIO.out_w1tc = enable_pin_mask;
    }
}

/**
 * @brief 关闭功率级并恢复三相中性占空比
 */
static void IRAM_ATTR disable_power_stage()
{
    phase_duty neutral_duty{};
    write_pwm_duty_from_isr(neutral_duty);
    set_enable_pin_from_isr(false);
}

/**
 * @brief 打开功率级使能
 *
 * @return 打开成功时返回 true
 */
static bool enable_power_stage()
{
    if(!pwm_initialized)
    {
        return false;
    }

    return gpio_set_level(ENABLE_PIN, 1) == ESP_OK;
}

/**
 * @brief 计算固定 Alpha-Beta 电压对应的 SVPWM 占空比
 *
 * @param alpha_voltage_v Alpha 轴电压，单位伏特
 * @param beta_voltage_v Beta 轴电压，单位伏特
 * @param duty 用于接收三相占空比
 *
 * @return 计算成功且占空比未越界时返回 true
 */
static bool calculate_svpwm_duty(float alpha_voltage_v,
    float beta_voltage_v,
    phase_duty &duty)
{
    float phase_a_voltage_v = alpha_voltage_v;
    float phase_b_voltage_v = -0.5f * alpha_voltage_v +
        SQRT_THREE_OVER_TWO * beta_voltage_v;
    float phase_c_voltage_v = -0.5f * alpha_voltage_v -
        SQRT_THREE_OVER_TWO * beta_voltage_v;
    float maximum_voltage_v = phase_a_voltage_v;
    if(phase_b_voltage_v > maximum_voltage_v)
    {
        maximum_voltage_v = phase_b_voltage_v;
    }
    if(phase_c_voltage_v > maximum_voltage_v)
    {
        maximum_voltage_v = phase_c_voltage_v;
    }

    float minimum_voltage_v = phase_a_voltage_v;
    if(phase_b_voltage_v < minimum_voltage_v)
    {
        minimum_voltage_v = phase_b_voltage_v;
    }
    if(phase_c_voltage_v < minimum_voltage_v)
    {
        minimum_voltage_v = phase_c_voltage_v;
    }

    float common_mode_voltage_v = -0.5f *
        (maximum_voltage_v + minimum_voltage_v);
    float phase_a_duty = 0.5f +
        (phase_a_voltage_v + common_mode_voltage_v) /
            MOTOR_BUS_VOLTAGE_V;
    float phase_b_duty = 0.5f +
        (phase_b_voltage_v + common_mode_voltage_v) /
            MOTOR_BUS_VOLTAGE_V;
    float phase_c_duty = 0.5f +
        (phase_c_voltage_v + common_mode_voltage_v) /
            MOTOR_BUS_VOLTAGE_V;

    if(!(phase_a_duty >= 0.0f && phase_a_duty <= 1.0f) ||
        !(phase_b_duty >= 0.0f && phase_b_duty <= 1.0f) ||
        !(phase_c_duty >= 0.0f && phase_c_duty <= 1.0f))
    {
        duty = {};
        return false;
    }

    duty.phase_a = phase_a_duty;
    duty.phase_b = phase_b_duty;
    duty.phase_c = phase_c_duty;
    return true;
}

/* ---- ADC 初始化和读取 ---- */

/**
 * @brief 将一帧 ADC1 连续采样结果更新到电流快照
 *
 * @param samples 已解析的 ADC 样本数组
 * @param sample_count 样本数量
 *
 * @note 只在同一帧同时收到 O1/O2 时提交新快照，避免两路电流来自
 *       不同采样时刻。该函数运行在 ADC 读取任务中，不在 ISR 中解析。
 */
static void update_current_raw_samples(
    const adc_continuous_data_t *samples,
    uint32_t sample_count)
{
    uint32_t next_update_count = current_adc_update_count;
    current_adc_update_count = next_update_count + 1;
    current_adc_update_stage = 1;
    uint16_t next_current_a_raw = 0;
    uint16_t next_current_b_raw = 0;
    bool has_current_a = false;
    bool has_current_b = false;
    uint32_t current_a_count = 0;
    uint32_t current_b_count = 0;
    uint32_t invalid_count = 0;
    for(uint32_t index = 0; index < sample_count; index++)
    {
        if(!samples[index].valid)
        {
            invalid_count++;
            continue;
        }
        if(samples[index].channel == CURRENT_A_CHANNEL)
        {
            next_current_a_raw = static_cast<uint16_t>(
                samples[index].raw_data);
            has_current_a = true;
            current_a_count++;
        }
        else if(samples[index].channel == CURRENT_B_CHANNEL)
        {
            next_current_b_raw = static_cast<uint16_t>(
                samples[index].raw_data);
            has_current_b = true;
            current_b_count++;
        }
    }

    current_adc_update_stage = 2;
    current_adc_last_sample_count = sample_count;
    current_adc_last_a_count = current_a_count;
    current_adc_last_b_count = current_b_count;
    current_adc_last_invalid_count = invalid_count;

    if(!has_current_a || !has_current_b)
    {
        uint32_t next_no_pair_count = current_adc_no_pair_count;
        current_adc_no_pair_count = next_no_pair_count + 1;
        return;
    }

