BGzEroll/foc_v3p_esp32/user_lib/drivers/foc/esp32_hardware_test.cpp
    current_adc_update_stage = 3;
    uint32_t commit_timestamp_us = static_cast<uint32_t>(
        esp_timer_get_time());
    uint32_t packed_raw = static_cast<uint32_t>(next_current_a_raw) |
        (static_cast<uint32_t>(next_current_b_raw) << 16);
    uint32_t next_sequence = current_raw_sequence;
    next_sequence++;
    uint32_t writing_version = (next_sequence << 1) | 1U;
    __atomic_store_n(&current_raw_version,
        writing_version,
        __ATOMIC_RELEASE);
    current_adc_update_stage = 4;
    __atomic_store_n(&current_raw_packed,
        packed_raw,
        __ATOMIC_RELAXED);
    current_raw_sequence = next_sequence;
    uint32_t next_commit_count = current_adc_commit_count;
    current_adc_commit_count = next_commit_count + 1;
    current_adc_last_commit_sequence = current_raw_sequence;
    current_adc_last_commit_timestamp_us = commit_timestamp_us;
    __atomic_store_n(&current_raw_version,
        next_sequence << 1,
        __ATOMIC_RELEASE);
    current_adc_update_stage = 5;
}

struct current_raw_snapshot
{
    uint16_t raw_a = 0;
    uint16_t raw_b = 0;
    uint32_t sequence = 0;
    bool valid = false;
};

/**
 * @brief 无阻塞读取 ADC 双通道原始值快照
 *
 * @return 一致且已经提交的原始值快照
 *
 * @note 生产者先发布奇数版本号，再写入打包后的两个原始值，最后发布
 *       偶数版本号。读取方只接受两次读取到的版本号相同且为偶数的结果，
 *       因此 ISR 不需要等待任务释放自旋锁。
 */
static current_raw_snapshot IRAM_ATTR read_current_raw_snapshot()
{
    for(uint32_t attempt = 0; attempt < 2; attempt++)
    {
        uint32_t version_before = __atomic_load_n(&current_raw_version,
            __ATOMIC_ACQUIRE);
        if((version_before & 1U) != 0U)
        {
            continue;
        }

        uint32_t packed_raw = __atomic_load_n(&current_raw_packed,
            __ATOMIC_RELAXED);
        uint32_t version_after = __atomic_load_n(&current_raw_version,
            __ATOMIC_ACQUIRE);
        if(version_before == version_after)
        {
            current_raw_snapshot snapshot{};
            snapshot.raw_a = static_cast<uint16_t>(packed_raw & 0xffffU);
            snapshot.raw_b = static_cast<uint16_t>(packed_raw >> 16);
            snapshot.sequence = version_after >> 1;
            snapshot.valid = snapshot.sequence != 0;
            return snapshot;
        }
    }

    return {};
}

/**
 * @brief 从 ADC Continuous 驱动读取并解析电流采样帧
 *
 * @param argument 未使用
 *
 * @note 该任务固定运行在 CPU0。ADC 驱动 ISR 只负责把 DMA 帧放入
 *       驱动内部环形缓冲区，由此任务取出并更新供 MCPWM ISR 消费的
 *       最新双通道快照。
 */
static void adc_current_reader_task(void *argument)
{
    (void)argument;
    uint8_t raw_data[CURRENT_ADC_FRAME_SIZE] = {};
    adc_continuous_data_t parsed_data[
        CURRENT_ADC_FRAME_SIZE / SOC_ADC_DIGI_RESULT_BYTES] = {};

    while(true)
    {
        uint32_t bytes_read = 0;
        esp_err_t error = adc_continuous_read(adc1_continuous,
            raw_data,
            sizeof(raw_data),
            &bytes_read,
            ADC_MAX_DELAY);
        if(error != ESP_OK)
        {
            uint32_t next_error_count = current_adc_read_error_count;
            current_adc_read_error_count = next_error_count + 1;
            ESP_LOGE(TAG, "读取 ADC1 连续采样失败: %d",
                static_cast<int>(error));
            vTaskDelay(pdMS_TO_TICKS(1));
            continue;
        }

        uint32_t sample_count = 0;
        error = adc_continuous_parse_data(adc1_continuous,
            raw_data,
            bytes_read,
            parsed_data,
            &sample_count);
        if(error != ESP_OK)
        {
            ESP_LOGE(TAG, "解析 ADC1 连续采样失败: %d",
                static_cast<int>(error));
            continue;
        }

        uint32_t next_frame_count = current_adc_frame_count;
        current_adc_frame_count = next_frame_count + 1;
        current_adc_last_frame_size = bytes_read;
        update_current_raw_samples(parsed_data, sample_count);
        taskYIELD();
    }
}

/**
 * @brief 创建一个 ADC 线性标定句柄
 *
 * @param unit ADC 单元
 * @param calibration 用于接收标定句柄
 */
static void initialize_adc_calibration(adc_unit_t unit,
    adc_cali_handle_t &calibration)
{
    calibration = nullptr;
#if ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    adc_cali_line_fitting_config_t config = {};
    config.unit_id = unit;
    config.atten = ADC_ATTENUATION;
    config.bitwidth = ADC_BITWIDTH;
    config.default_vref = 1100;

    esp_err_t error = adc_cali_create_scheme_line_fitting(&config,
        &calibration);
    if(error == ESP_OK)
    {
        ESP_LOGI(TAG, "ADC%d 使用线性标定",
            static_cast<int>(unit) + 1);
    }
    else
    {
        ESP_LOGW(TAG, "ADC%d 无法使用线性标定，回退到近似换算: %d",
            static_cast<int>(unit) + 1,
            static_cast<int>(error));
    }
#else
    ESP_LOGW(TAG, "ADC%d 不支持线性标定，使用近似换算",
        static_cast<int>(unit) + 1);
#endif
}

/**
 * @brief 初始化 ADC1 电流通道和 ADC2 母线采样通道
 *
 * @return 电流 ADC 初始化成功时返回 true
 */
static bool initialize_adc()
{
    current_raw_packed = 0;
    current_raw_version = 0;
    current_raw_sequence = 0;
    current_isr_last_raw_a = 0;
    current_isr_last_raw_b = 0;
    current_isr_last_good_raw_sequence = 0;
    current_isr_snapshot_retry_count = 0;
    current_adc_commit_count = 0;
    current_adc_last_commit_sequence = 0;
    current_adc_last_commit_timestamp_us = 0;
    current_adc_update_count = 0;
    current_adc_no_pair_count = 0;
    current_adc_update_stage = 0;
    current_adc_dma_callback_count = 0;
    current_adc_dma_core_id = 0xff;
    current_adc_dma_last_timestamp_us = 0;
    current_adc_start_frame_count = 0;
    current_adc_start_update_count = 0;
    current_adc_start_dma_callback_count = 0;

    adc_continuous_handle_cfg_t continuous_handle_config = {};
    continuous_handle_config.max_store_buf_size = CURRENT_ADC_FRAME_SIZE * 4;
    continuous_handle_config.conv_frame_size = CURRENT_ADC_FRAME_SIZE;
    continuous_handle_config.flags.flush_pool = true;

    esp_err_t error = adc_continuous_new_handle(&continuous_handle_config,
        &adc1_continuous);
    if(error != ESP_OK)
    {
        ESP_LOGE(TAG, "初始化 ADC1 连续采样失败: %d",
            static_cast<int>(error));
        return false;
    }

    adc_digi_pattern_config_t adc_pattern[2] = {};
    adc_pattern[0].atten = ADC_ATTENUATION;
    adc_pattern[0].channel = CURRENT_A_CHANNEL;
    adc_pattern[0].unit = ADC_UNIT_1;
    adc_pattern[0].bit_width = SOC_ADC_DIGI_MAX_BITWIDTH;
    adc_pattern[1].atten = ADC_ATTENUATION;
    adc_pattern[1].channel = CURRENT_B_CHANNEL;
    adc_pattern[1].unit = ADC_UNIT_1;
    adc_pattern[1].bit_width = SOC_ADC_DIGI_MAX_BITWIDTH;

    adc_continuous_config_t continuous_config = {};
    continuous_config.pattern_num = 2;
    continuous_config.adc_pattern = adc_pattern;
    continuous_config.sample_freq_hz = CURRENT_ADC_SAMPLE_FREQ_HZ;
    continuous_config.conv_mode = ADC_CONV_SINGLE_UNIT_1;
    error = adc_continuous_config(adc1_continuous, &continuous_config);
    if(error != ESP_OK)
    {
        ESP_LOGE(TAG, "配置 ADC1 连续采样通道失败: %d",
            static_cast<int>(error));
        adc_continuous_deinit(adc1_continuous);
        adc1_continuous = nullptr;
        return false;
    }

    adc_continuous_evt_cbs_t callbacks = {};
    callbacks.on_conv_done = adc_conversion_done_callback;
    error = adc_continuous_register_event_callbacks(adc1_continuous,
        &callbacks,
        nullptr);
    if(error != ESP_OK)
    {
        ESP_LOGE(TAG, "注册 ADC1 连续采样回调失败: %d",
            static_cast<int>(error));
        adc_continuous_deinit(adc1_continuous);
        adc1_continuous = nullptr;
        return false;
    }

    error = adc_continuous_start(adc1_continuous);
    if(error != ESP_OK)
    {
        ESP_LOGE(TAG, "启动 ADC1 连续采样失败: %d", static_cast<int>(error));
        adc_continuous_deinit(adc1_continuous);
        adc1_continuous = nullptr;
        return false;
    }

    BaseType_t task_result = xTaskCreatePinnedToCore(
        adc_current_reader_task,
        "adc_current",
        3072,
        nullptr,
        CURRENT_ADC_TASK_PRIORITY,
        nullptr,
        CURRENT_ADC_TASK_CORE);
    if(task_result != pdPASS)
    {
        ESP_LOGE(TAG, "创建 ADC1 电流采样任务失败");
        adc_continuous_stop(adc1_continuous);
        adc_continuous_deinit(adc1_continuous);
        adc1_continuous = nullptr;
        return false;
    }

    adc_oneshot_unit_init_cfg_t adc2_config = {};
    adc2_config.unit_id = ADC_UNIT_2;
    adc2_config.clk_src = ADC_RTC_CLK_SRC_DEFAULT;
    adc2_config.ulp_mode = ADC_ULP_MODE_DISABLE;
    error = adc_oneshot_new_unit(&adc2_config, &adc2_unit);
    if(error != ESP_OK)
    {
        ESP_LOGW(TAG, "初始化 ADC2 失败，暂不记录 GPIO%d 母线采样: %d",
            static_cast<int>(BUS_SENSE_PIN),
            static_cast<int>(error));
        adc2_unit = nullptr;
        return true;
    }

    adc_oneshot_chan_cfg_t channel_config = {};
    channel_config.atten = ADC_ATTENUATION;
    channel_config.bitwidth = ADC_BITWIDTH;
    error = adc_oneshot_config_channel(adc2_unit,
        BUS_SENSE_CHANNEL,
        &channel_config);
    if(error != ESP_OK)
    {
        ESP_LOGW(TAG, "配置 GPIO%d ADC 通道失败，暂不记录母线采样: %d",
            static_cast<int>(BUS_SENSE_PIN),
            static_cast<int>(error));
        adc_oneshot_del_unit(adc2_unit);
        adc2_unit = nullptr;
        return true;
    }

    initialize_adc_calibration(ADC_UNIT_2, adc2_calibration);
    bus_sense_available = true;
    return true;
}

/**
 * @brief 读取一个 ADC 通道的毫伏值
 *
 * @param unit ADC 单元句柄
 * @param calibration ADC 标定句柄，可为空
 * @param channel ADC 通道
 * @param voltage_mv 用于接收电压，单位毫伏
 *
 * @return 读取成功时返回 true
 */
static bool read_adc_millivolts(adc_oneshot_unit_handle_t unit,
    adc_cali_handle_t calibration,
    adc_channel_t channel,
    int32_t &voltage_mv)
{
    if(!unit)
    {
        return false;
    }

