BGzEroll/foc_v3p_esp32/user_lib/drivers/foc/esp32_hardware_test.cpp
    int raw_value = 0;
    esp_err_t error = adc_oneshot_read(unit, channel, &raw_value);
    if(error != ESP_OK)
    {
        return false;
    }

    if(calibration)
    {
        int calibrated_voltage_mv = 0;
        error = adc_cali_raw_to_voltage(calibration,
            raw_value,
            &calibrated_voltage_mv);
        if(error == ESP_OK)
        {
            voltage_mv = static_cast<int32_t>(calibrated_voltage_mv);
            return true;
        }
    }

    voltage_mv = static_cast<int32_t>(
        static_cast<float>(raw_value) * ADC_RAW_TO_MV);
    return true;
}

/**
 * @brief 读取两路电流采样的毫伏值并进行中值滤波
 *
 * @param voltage_a_mv A 路电压，单位毫伏
 * @param voltage_b_mv B 路电压，单位毫伏
 *
 * @return 读取成功时返回 true
 */
static bool read_current_millivolts(int32_t &voltage_a_mv,
    int32_t &voltage_b_mv)
{
    current_raw_snapshot initial_snapshot = read_current_raw_snapshot();
    if(!initial_snapshot.valid)
    {
        return false;
    }

    int32_t samples_a_mv[CURRENT_SAMPLE_COUNT] = {};
    int32_t samples_b_mv[CURRENT_SAMPLE_COUNT] = {};
    for(uint32_t index = 0; index < CURRENT_SAMPLE_COUNT; index++)
    {
        current_raw_snapshot snapshot = read_current_raw_snapshot();
        if(!snapshot.valid)
        {
            return false;
        }
        uint16_t raw_a = snapshot.raw_a;
        uint16_t raw_b = snapshot.raw_b;
        samples_a_mv[index] = static_cast<int32_t>(
            static_cast<float>(raw_a) * ADC_RAW_TO_MV);
        samples_b_mv[index] = static_cast<int32_t>(
            static_cast<float>(raw_b) * ADC_RAW_TO_MV);
        if(index + 1 < CURRENT_SAMPLE_COUNT)
        {
            esp_rom_delay_us(CURRENT_SAMPLE_SPACING_US);
        }
    }

    for(uint32_t index = 1; index < CURRENT_SAMPLE_COUNT; index++)
    {
        int32_t value_a_mv = samples_a_mv[index];
        int32_t value_b_mv = samples_b_mv[index];
        uint32_t sorted_index = index;
        while(sorted_index > 0 &&
            samples_a_mv[sorted_index - 1] > value_a_mv)
        {
            samples_a_mv[sorted_index] =
                samples_a_mv[sorted_index - 1];
            sorted_index--;
        }
        samples_a_mv[sorted_index] = value_a_mv;

        sorted_index = index;
        while(sorted_index > 0 &&
            samples_b_mv[sorted_index - 1] > value_b_mv)
        {
            samples_b_mv[sorted_index] =
                samples_b_mv[sorted_index - 1];
            sorted_index--;
        }
        samples_b_mv[sorted_index] = value_b_mv;
    }

    voltage_a_mv = samples_a_mv[CURRENT_SAMPLE_COUNT / 2];
    voltage_b_mv = samples_b_mv[CURRENT_SAMPLE_COUNT / 2];
    return true;
}

/**
 * @brief 在功率级关闭时校准两路电流零点
 *
 * @return 校准成功时返回 true
 */
static bool calibrate_current_offsets()
{
    int64_t sum_a_mv = 0;
    int64_t sum_b_mv = 0;
    for(uint32_t index = 0;
        index < CURRENT_OFFSET_SAMPLE_COUNT;
        index++)
    {
        int32_t voltage_a_mv = 0;
        int32_t voltage_b_mv = 0;
        if(!read_current_millivolts(voltage_a_mv, voltage_b_mv))
        {
            ESP_LOGE(TAG, "电流零点校准读取失败，样本=%d",
                static_cast<int>(index));
            return false;
        }

        sum_a_mv += voltage_a_mv;
        sum_b_mv += voltage_b_mv;
        vTaskDelay(pdMS_TO_TICKS(1));
    }

    current_offset_a_mv = static_cast<float>(sum_a_mv) /
        CURRENT_OFFSET_SAMPLE_COUNT;
    current_offset_b_mv = static_cast<float>(sum_b_mv) /
        CURRENT_OFFSET_SAMPLE_COUNT;
    ESP_LOGI(TAG, "电流零点: O1=%.2f mV, O2=%.2f mV",
        current_offset_a_mv,
        current_offset_b_mv);
    return true;
}

/**
 * @brief 将电流采样毫伏值换算为两路相电流
 *
 * @param voltage_a_mv A 路电压，单位毫伏
 * @param voltage_b_mv B 路电压，单位毫伏
 * @param phase_a_a 用于接收 A 相电流，单位安培
 * @param phase_b_a 用于接收 B 相电流，单位安培
 * @param phase_c_a 用于接收重构的 C 相电流，单位安培
 */
static void IRAM_ATTR convert_current(int32_t voltage_a_mv,
    int32_t voltage_b_mv,
    float &phase_a_a,
    float &phase_b_a,
    float &phase_c_a)
{
    phase_a_a = (static_cast<float>(voltage_a_mv) -
        current_offset_a_mv) * CURRENT_SCALE_A_PER_MV *
        CURRENT_SENSE_SIGN;
    phase_b_a = (static_cast<float>(voltage_b_mv) -
        current_offset_b_mv) * CURRENT_SCALE_A_PER_MV *
        CURRENT_SENSE_SIGN;
    phase_c_a = -phase_a_a - phase_b_a;
}

/**
 * @brief 读取当前两路采样对应的三相电流
 *
 * @param phase_a_a 用于接收 A 相电流，单位安培
 * @param phase_b_a 用于接收 B 相电流，单位安培
 * @param phase_c_a 用于接收 C 相电流，单位安培
 *
 * @return 读取成功时返回 true
 */
static bool read_phase_currents(float &phase_a_a,
    float &phase_b_a,
    float &phase_c_a)
{
    int32_t voltage_a_mv = 0;
    int32_t voltage_b_mv = 0;
    if(!read_current_millivolts(voltage_a_mv, voltage_b_mv))
    {
        return false;
    }

    convert_current(voltage_a_mv,
        voltage_b_mv,
        phase_a_a,
        phase_b_a,
        phase_c_a);
    return true;
}

/* ---- AS5600 读取和传感器对齐 ---- */

/**
 * @brief 读取 AS5600 原始机械角度
 *
 * @param angle_rad 用于接收机械角度，单位弧度
 *
 * @return 读取成功时返回 true
 */
static bool read_encoder_angle(float &angle_rad)
{
    int64_t read_start_us = esp_timer_get_time();
    uint8_t data[2] = {};
    i2c_result result = i2c_result::BUS_ERROR;
    for(uint32_t attempt = 0;
        attempt <= ENCODER_READ_RETRY_COUNT;
        ++attempt)
    {
        result = encoder_device.read_bytes(
            AS5600_RAW_ANGLE_REGISTER,
            data,
            2,
            5);
        if(result == i2c_result::OK)
        {
            break;
        }
        if(attempt == ENCODER_READ_RETRY_COUNT)
        {
            break;
        }
        encoder_read_attempt_failure_count++;
        if(result == i2c_result::TRANSFER_TIMEOUT ||
            result == i2c_result::BUS_ERROR ||
            result == i2c_result::NACK)
        {
            encoder_bus_reset_count++;
            encoder_bus.reset();
        }
        vTaskDelay(pdMS_TO_TICKS(ENCODER_RETRY_DELAY_MS));
    }
    if(result != i2c_result::OK)
    {
        uint32_t read_duration_us = static_cast<uint32_t>(
            esp_timer_get_time() - read_start_us);
        encoder_last_read_duration_us = read_duration_us;
        if(read_duration_us > encoder_max_read_duration_us)
        {
            encoder_max_read_duration_us = read_duration_us;
        }
        ESP_LOGW(TAG,
            "AS5600 读取失败: result=%d，已尝试复位 I2C；请重新插拔驱动板供电后重试",
            static_cast<int>(result));
        return false;
    }

    uint32_t read_duration_us = static_cast<uint32_t>(
        esp_timer_get_time() - read_start_us);
    encoder_last_read_duration_us = read_duration_us;
    if(read_duration_us > encoder_max_read_duration_us)
    {
        encoder_max_read_duration_us = read_duration_us;
    }

    uint16_t raw_angle = (static_cast<uint16_t>(data[0]) << 8) |
        static_cast<uint16_t>(data[1]);
    raw_angle &= 0x0FFF;
    angle_rad = static_cast<float>(raw_angle) * TWO_PI / 4096.0f;
    return true;
}

/**
 * @brief 清除编码器连续角度和速度历史
 */
static void reset_encoder_tracking()
{
    encoder_tracking_valid = false;
    encoder_previous_angle_rad = 0.0f;
    encoder_unwrapped_angle_rad = 0.0f;
    encoder_previous_timestamp_us = 0;
    encoder_velocity_reference_valid = false;
    encoder_velocity_reference_angle_rad = 0.0f;
    encoder_velocity_reference_timestamp_us = 0;
    encoder_velocity_rad_s = 0.0f;
}

static bool start_pwm_carrier_for_alignment();
static bool stop_pwm_carrier_for_alignment();

/**
 * @brief 根据固定 Alpha 轴电压矢量执行转子对齐
 *
 * @param electrical_zero_offset_rad 用于接收电角度零点偏移
 *
 * @return 对齐成功时返回 true
 */
static bool align_sensor(float &electrical_zero_offset_rad)
{
    phase_duty alignment_duty{};
    if(!calculate_svpwm_duty(ALIGNMENT_VOLTAGE_V,
        0.0f,
        alignment_duty))
    {
        ESP_LOGE(TAG, "计算传感器对齐占空比失败");
        return false;
    }

    if(!start_pwm_carrier_for_alignment())
    {
        ESP_LOGE(TAG, "传感器对齐时无法启动 PWM 载波");
        return false;
    }

    if(write_pwm_duty(alignment_duty) != foc_result::OK)
    {
        ESP_LOGE(TAG, "输出传感器对齐电压失败");
        stop_pwm_carrier_for_alignment();
        return false;
    }

    if(!enable_power_stage())
    {
        ESP_LOGE(TAG, "传感器对齐时无法打开驱动器");
        disable_power_stage();
        stop_pwm_carrier_for_alignment();
        return false;
    }

    vTaskDelay(pdMS_TO_TICKS(20));
    int64_t alignment_end_us = esp_timer_get_time() +
        static_cast<int64_t>(ALIGNMENT_DURATION_MS) * 1000;
    while(esp_timer_get_time() < alignment_end_us)
    {
        float phase_a_a = 0.0f;
        float phase_b_a = 0.0f;
        float phase_c_a = 0.0f;
        if(!read_phase_currents(phase_a_a, phase_b_a, phase_c_a))
        {
            ESP_LOGE(TAG, "传感器对齐时无法读取电流");
            disable_power_stage();
            stop_pwm_carrier_for_alignment();
            return false;
        }

