BGzEroll/foc_v3p_esp32/user_lib/drivers/foc/esp32_hardware_test.cpp
        if(absolute_value(phase_a_a) > ALIGNMENT_MAX_PHASE_CURRENT_A ||
            absolute_value(phase_b_a) > ALIGNMENT_MAX_PHASE_CURRENT_A ||
            absolute_value(phase_c_a) > ALIGNMENT_MAX_PHASE_CURRENT_A)
        {
            ESP_LOGE(TAG, "传感器对齐过流: A=%.3f B=%.3f C=%.3f",
                phase_a_a,
                phase_b_a,
                phase_c_a);
            disable_power_stage();
            stop_pwm_carrier_for_alignment();
            return false;
        }

        vTaskDelay(pdMS_TO_TICKS(1));
    }

    float aligned_mechanical_angle_rad = 0.0f;
    if(!read_encoder_angle(aligned_mechanical_angle_rad))
    {
        disable_power_stage();
        stop_pwm_carrier_for_alignment();
        ESP_LOGE(TAG, "传感器对齐后无法读取机械角度");
        return false;
    }

    electrical_zero_offset_rad = normalize_angle(
        static_cast<float>(MOTOR_ROTOR_DIRECTION) *
        static_cast<float>(MOTOR_POLE_PAIRS) *
        aligned_mechanical_angle_rad);
    disable_power_stage();
    if(!stop_pwm_carrier_for_alignment())
    {
        ESP_LOGE(TAG, "停止传感器对齐 PWM 载波失败");
        return false;
    }
    vTaskDelay(pdMS_TO_TICKS(20));
    reset_encoder_tracking();
    ESP_LOGI(TAG, "传感器对齐完成: mechanical=%.5f, zero=%.5f",
        aligned_mechanical_angle_rad,
        electrical_zero_offset_rad);
    return true;
}

/**
 * @brief 读取并展开一个 AS5600 转子样本
 *
 * @param timestamp_us 本次采样时间戳，单位微秒
 * @param sequence 样本序号
 * @param sample 用于接收转子样本
 *
 * @return 读取成功时返回 true
 */
static bool read_rotor_sample(int64_t timestamp_us,
    uint32_t sequence,
    rotor_sample &sample)
{
    sample = {};
    sample.sequence = sequence;
    sample.timestamp_us = static_cast<uint32_t>(timestamp_us);

    float angle_rad = 0.0f;
    if(!read_encoder_angle(angle_rad))
    {
        return false;
    }

    if(!encoder_tracking_valid)
    {
        encoder_previous_angle_rad = angle_rad;
        encoder_unwrapped_angle_rad = angle_rad;
        encoder_previous_timestamp_us = timestamp_us;
        encoder_velocity_reference_angle_rad =
            encoder_unwrapped_angle_rad;
        encoder_velocity_reference_timestamp_us = timestamp_us;
        encoder_velocity_reference_valid = true;
        encoder_tracking_valid = true;
    }
    else
    {
        float delta_angle_rad = angle_rad - encoder_previous_angle_rad;
        if(delta_angle_rad > PI)
        {
            delta_angle_rad -= TWO_PI;
        }
        else if(delta_angle_rad < -PI)
        {
            delta_angle_rad += TWO_PI;
        }

        int64_t delta_time_us = timestamp_us -
            encoder_previous_timestamp_us;
        if(delta_time_us <= 0)
        {
            return false;
        }

        float sample_speed_rad_s = delta_angle_rad /
            (static_cast<float>(delta_time_us) * 1.0e-6f);
        if(absolute_value(sample_speed_rad_s) >
            ENCODER_MAX_SAMPLE_SPEED_RAD_S)
        {
            encoder_rejected_sample_count.fetch_add(1,
                std::memory_order_relaxed);
            return false;
        }

        encoder_unwrapped_angle_rad += delta_angle_rad;
        encoder_previous_angle_rad = angle_rad;
        encoder_previous_timestamp_us = timestamp_us;

        if(encoder_velocity_reference_valid)
        {
            int64_t velocity_delta_time_us = timestamp_us -
                encoder_velocity_reference_timestamp_us;
            if(velocity_delta_time_us >=
                static_cast<int64_t>(VELOCITY_ESTIMATION_PERIOD_US))
            {
                encoder_velocity_rad_s =
                    (encoder_unwrapped_angle_rad -
                        encoder_velocity_reference_angle_rad) /
                    (static_cast<float>(velocity_delta_time_us) * 1.0e-6f);
                encoder_velocity_reference_angle_rad =
                    encoder_unwrapped_angle_rad;
                encoder_velocity_reference_timestamp_us = timestamp_us;
            }
        }
    }

    sample.mechanical_angle_rad = encoder_unwrapped_angle_rad;
    sample.mechanical_velocity_rad_s = encoder_velocity_rad_s;
    sample.valid = true;
    return true;
}

/* ---- foc_output 回调和控制任务 ---- */

/**
 * @brief 初始化 FOC 功率输出回调
 *
 * @param context 输出上下文
 *
 * @return 初始化结果
 */
static foc_result foc_output_init(void *context)
{
    if(!initialize_power_output())
    {
        return foc_result::DRIVER_FAULT;
    }

    phase_duty neutral_duty{};
    return write_pwm_duty(neutral_duty);
}

/**
 * @brief 打开 FOC 功率输出回调
 *
 * @param context 输出上下文
 *
 * @return 打开结果
 */
static foc_result foc_output_enable(void *context)
{
    return enable_power_stage() ? foc_result::OK :
        foc_result::DRIVER_FAULT;
}

/**
 * @brief 关闭 FOC 功率输出回调
 *
 * @param context 输出上下文
 */
static void IRAM_ATTR foc_output_disable(void *context)
{
    disable_power_stage();
}

/**
 * @brief 应用任务上下文中的三相占空比
 *
 * @param context 输出上下文
 * @param duty 三相占空比
 *
 * @return 应用结果
 */
static foc_result foc_output_apply_duty(void *context,
    const phase_duty &duty)
{
    return write_pwm_duty(duty);
}

/**
 * @brief 应用 ISR 上下文中的三相占空比
 *
 * @param context 输出上下文
 * @param duty 三相占空比
 *
 * @return 输出结果
 */
static foc_result IRAM_ATTR foc_output_apply_duty_from_isr(void *context,
    const phase_duty &duty)
{
    return write_pwm_duty_from_isr(duty);
}

/**
 * @brief 查询功率级硬件故障输入
 *
 * @param context 输出上下文
 *
 * @return 当前硬件无故障输入，固定返回 false
 */
static bool foc_output_fault_active(void *context)
{
    return false;
}

/**
 * @brief 创建当前测试使用的 FOC 输出回调表
 *
 * @return FOC 输出回调表
 */
static foc_output create_foc_output()
{
    foc_output output{};
    output.init = foc_output_init;
    output.enable = foc_output_enable;
    output.disable = foc_output_disable;
    output.apply_duty = foc_output_apply_duty;
    output.apply_duty_from_isr = foc_output_apply_duty_from_isr;
    output.fault_active = foc_output_fault_active;
    return output;
}

/**
 * @brief 读取驱动板分压后的 GPIO4 母线采样管脚电压
 *
 * @note GPIO4 接收的是驱动板已经分压后的电压。由于尚未确认分压电阻比，
 *       当前只记录管脚电压，FOC 母线配置仍使用已知的 12 V。GPIO4 属于
 *       经典 ESP32 的 ADC2；以后启用 Wi-Fi 后该采样可能不可用。
 */
static void read_bus_sense()
{
    int64_t read_start_us = esp_timer_get_time();
    if(!bus_sense_available)
    {
        bus_sense_read_valid = false;
        bus_sense_last_duration_us = static_cast<uint32_t>(
            esp_timer_get_time() - read_start_us);
        return;
    }

    bus_sense_read_valid = read_adc_millivolts(adc2_unit,
        adc2_calibration,
        BUS_SENSE_CHANNEL,
        bus_sense_voltage_mv);
    uint32_t read_duration_us = static_cast<uint32_t>(
        esp_timer_get_time() - read_start_us);
    bus_sense_last_duration_us = read_duration_us;
    if(read_duration_us > bus_sense_max_duration_us)
    {
        bus_sense_max_duration_us = read_duration_us;
    }
}

/**
 * @brief 在控制 ISR 中将最新 ADC 原始值发布为电流 Topic
 *
 * @param timestamp_us 当前控制周期时间戳，单位微秒
 * @param higher_priority_task_woken ISR 任务唤醒标记
 *
 * @return 发布成功时返回 true
 */
static bool IRAM_ATTR publish_current_sample_from_isr(
    uint32_t timestamp_us,
    BaseType_t &higher_priority_task_woken)
{
    current_raw_snapshot raw_snapshot = read_current_raw_snapshot();
    if(raw_snapshot.valid)
    {
        current_isr_last_raw_a = raw_snapshot.raw_a;
        current_isr_last_raw_b = raw_snapshot.raw_b;
        current_isr_last_good_raw_sequence = raw_snapshot.sequence;
    }
    else
    {
        uint32_t next_retry_count = current_isr_snapshot_retry_count;
        current_isr_snapshot_retry_count = next_retry_count + 1;
        raw_snapshot.raw_a = current_isr_last_raw_a;
        raw_snapshot.raw_b = current_isr_last_raw_b;
        raw_snapshot.sequence = current_isr_last_good_raw_sequence;
        raw_snapshot.valid = raw_snapshot.sequence != 0;
    }
    uint32_t raw_sequence = raw_snapshot.sequence;
    uint16_t raw_a = raw_snapshot.raw_a;
    uint16_t raw_b = raw_snapshot.raw_b;
    current_isr_unlocked_raw_sequence = raw_sequence;
    if(raw_sequence != current_isr_last_raw_sequence)
    {
        current_isr_last_raw_sequence = raw_sequence;
        current_isr_last_timestamp_us = timestamp_us;
    }

    phase_current_sample sample{};
    sample.sequence = ++current_isr_sequence;
    sample.timestamp_us = current_isr_last_timestamp_us;
    sample.valid = raw_snapshot.valid &&
        static_cast<uint32_t>(timestamp_us - current_isr_last_timestamp_us) <=
            CURRENT_SAMPLE_TIMEOUT_US;
    if(sample.valid)
    {
        int32_t voltage_a_mv = static_cast<int32_t>(
            static_cast<float>(raw_a) * ADC_RAW_TO_MV);
        int32_t voltage_b_mv = static_cast<int32_t>(
            static_cast<float>(raw_b) * ADC_RAW_TO_MV);
        convert_current(voltage_a_mv,
            voltage_b_mv,
            sample.phase_a_a,
            sample.phase_b_a,
            sample.phase_c_a);
    }

    if(!control_topics)
    {
        return false;
    }
    return control_topics->current.publish_from_isr(sample,
        higher_priority_task_woken);
}

/**
 * @brief MCPWM 定时器 ISR 回调
 *
 * @param timer MCPWM 定时器句柄
 * @param event_data MCPWM 定时器事件数据
 * @param user_data 用户上下文
 *
 * @return 是否请求调度更高优先级任务
 */
static bool IRAM_ATTR control_timer_alarm_callback(
    mcpwm_timer_handle_t timer,
    const mcpwm_timer_event_data_t *event_data,
    void *user_data)
{
    (void)timer;
    (void)event_data;
    (void)user_data;
    control_isr_in_progress = true;
    if(!control_timer_running || control_isr_fault)
    {
        control_isr_in_progress = false;
        return false;
    }

    control_isr_core_id = static_cast<uint8_t>(xPortGetCoreID());
    uint32_t start_cycles = esp_cpu_get_cycle_count();
    BaseType_t higher_priority_task_woken = pdFALSE;
    uint32_t timestamp_us = static_cast<uint32_t>(esp_timer_get_time());
    publish_current_sample_from_isr(timestamp_us,
        higher_priority_task_woken);
    foc_result result = motor.core_loop_from_isr(timestamp_us,
        higher_priority_task_woken);
    uint32_t next_tick_count = control_isr_tick_count;
    control_isr_tick_count = next_tick_count + 1;
    control_isr_last_timestamp_us = timestamp_us;
    control_isr_last_result = static_cast<uint8_t>(result);
    if(result != foc_result::OK && result != foc_result::DISABLED)
    {
        control_isr_fault = true;
        control_isr_fault_result = static_cast<uint8_t>(result);
        control_isr_fault_timestamp_us = timestamp_us;
        control_isr_fault_current_age_us = static_cast<uint32_t>(
            timestamp_us - current_isr_last_timestamp_us);
        control_isr_fault_raw_sequence = current_raw_sequence;
        control_isr_fault_locked_sequence = current_isr_last_raw_sequence;
        control_isr_fault_unlocked_sequence =
            current_isr_unlocked_raw_sequence;
        control_isr_fault_sample_count = current_adc_last_sample_count;
        control_isr_fault_a_count = current_adc_last_a_count;
        control_isr_fault_b_count = current_adc_last_b_count;
        control_isr_fault_invalid_count = current_adc_last_invalid_count;
        control_isr_fault_commit_count = current_adc_commit_count;
        control_isr_fault_commit_sequence =
            current_adc_last_commit_sequence;
        control_isr_fault_commit_age_us = static_cast<uint32_t>(
            timestamp_us - current_adc_last_commit_timestamp_us);
        control_isr_fault_update_count = current_adc_update_count;
        control_isr_fault_no_pair_count = current_adc_no_pair_count;
        control_isr_fault_update_stage = current_adc_update_stage;
        control_isr_fault_dma_callback_count =
            current_adc_dma_callback_count;
        control_isr_fault_dma_core_id = current_adc_dma_core_id;
        control_isr_fault_dma_age_us = static_cast<uint32_t>(
            timestamp_us - current_adc_dma_last_timestamp_us);
        control_isr_fault_frame_delta = current_adc_frame_count -
            current_adc_start_frame_count;
        control_isr_fault_update_delta = current_adc_update_count -
            current_adc_start_update_count;
        control_isr_fault_dma_delta = current_adc_dma_callback_count -
            current_adc_start_dma_callback_count;
        control_isr_fault_snapshot_retry_count =
            current_isr_snapshot_retry_count;
        rotor_sample fault_rotor{};
        bool rotor_peek_ok = control_topics &&
            control_topics->rotor.peek_from_isr(fault_rotor);
        control_isr_fault_rotor_peek_ok = rotor_peek_ok ? 1 : 0;
        control_isr_fault_rotor_valid =
            rotor_peek_ok && fault_rotor.valid ? 1 : 0;
        control_isr_fault_rotor_age_us = rotor_peek_ok ?
            static_cast<uint32_t>(timestamp_us - fault_rotor.timestamp_us) :
            0;
        control_isr_fault_task_iteration_count = control_task_iteration_count;
        control_isr_fault_task_stage = control_task_stage;
        control_isr_fault_task_stage_age_us = static_cast<uint32_t>(
            timestamp_us - control_task_stage_timestamp_us);
    }
    uint32_t elapsed_cycles = esp_cpu_get_cycle_count() - start_cycles;
    control_isr_last_cycles = elapsed_cycles;
    if(elapsed_cycles > control_isr_max_cycles)
    {
        control_isr_max_cycles = elapsed_cycles;
    }
    control_isr_in_progress = false;
    return higher_priority_task_woken == pdTRUE;
}

/**
 * @brief 初始化 MCPWM FOC 控制定时器
 *
 * @return 初始化成功时返回 true
 */
static bool register_and_enable_control_timer()
{
    if(!control_timer)
    {
        return false;
    }

    mcpwm_timer_event_callbacks_t callbacks = {};
    callbacks.on_empty = control_timer_alarm_callback;
    esp_err_t error = mcpwm_timer_register_event_callbacks(control_timer,
        &callbacks,
        nullptr);
    if(error != ESP_OK)
    {
        ESP_LOGE(TAG, "注册 MCPWM FOC 控制定时器回调失败: %d",
            static_cast<int>(error));
        return false;
    }

    error = mcpwm_timer_enable(control_timer);
    if(error != ESP_OK)
    {
        ESP_LOGE(TAG, "使能 MCPWM FOC 控制定时器失败: %d",
            static_cast<int>(error));
        return false;
    }
    return true;
}

/**
 * @brief 在指定 CPU 上注册并使能 MCPWM 控制定时器中断
 *
 * @param argument 未使用
 *
 * @note MCPWM 驱动会把中断分配到调用注册函数的 CPU。让 CPU1 执行该
 *       操作，可以把 CPU0 留给 ADC1 连续采样和 I2C 控制任务。
 */
static void initialize_control_timer_on_core(void *argument)
{
    (void)argument;
    control_timer_initialize_result = register_and_enable_control_timer() ?
        ESP_OK : ESP_FAIL;
}

/**
 * @brief 初始化 MCPWM FOC 控制定时器
 *
 * @return 初始化成功时返回 true
 */
static bool initialize_control_timer()
{
    if(xPortGetCoreID() == CONTROL_ISR_CORE)
    {
        return register_and_enable_control_timer();
    }

    control_timer_initialize_result = ESP_FAIL;
    esp_err_t error = esp_ipc_call_blocking(
        static_cast<uint32_t>(CONTROL_ISR_CORE),
        initialize_control_timer_on_core,
        nullptr);
    if(error != ESP_OK || control_timer_initialize_result != ESP_OK)
    {
        ESP_LOGE(TAG, "在 CPU%d 上初始化 MCPWM 控制定时器失败: ipc=%d, init=%d",
            static_cast<int>(CONTROL_ISR_CORE),
            static_cast<int>(error),
            static_cast<int>(control_timer_initialize_result));
        return false;
    }
    return true;
}

/**
 * @brief 启动仅用于传感器对齐的 MCPWM 载波
 *
 * @return 启动成功时返回 true
 *
 * @note 此时 control_timer_running 保持为 false，MCPWM 回调只会快速返回，
 *       不会访问尚未初始化完成的 FOC 核心。
 */
static bool start_pwm_carrier_for_alignment()
{
    if(!control_timer)
    {
        return false;
    }
    if(control_timer_started)
    {
        return true;
    }

    control_timer_running = false;
    esp_err_t error = mcpwm_timer_start_stop(control_timer,
        MCPWM_TIMER_START_NO_STOP);
    if(error != ESP_OK)
    {
        ESP_LOGE(TAG, "启动传感器对齐 PWM 载波失败: %d",
            static_cast<int>(error));
        return false;
    }
    control_timer_started = true;
    return true;
}

/**
 * @brief 停止传感器对齐期间使用的 MCPWM 载波
 *
 * @return 停止成功时返回 true
 */
static bool stop_pwm_carrier_for_alignment()
{
    control_timer_running = false;
    bool stop_successful = true;
    if(control_timer && control_timer_started)
    {
        esp_err_t error = mcpwm_timer_start_stop(control_timer,
            MCPWM_TIMER_STOP_EMPTY);
        if(error != ESP_OK)
        {
            ESP_LOGE(TAG, "停止传感器对齐 PWM 载波失败: %d",
                static_cast<int>(error));
            stop_successful = false;
        }
        control_timer_started = false;
    }

    while(control_isr_in_progress)
    {
        taskYIELD();
    }
    return stop_successful;
}

/**
 * @brief 启动 FOC 控制定时器
 *
 * @return 启动成功时返回 true
 */
static bool start_control_timer()
{
    if(!control_timer || control_timer_started)
    {
        return control_timer_started;
    }

    control_isr_fault = false;
    control_isr_fault_result = static_cast<uint8_t>(foc_result::NOT_READY);
    control_isr_last_result = static_cast<uint8_t>(foc_result::NOT_READY);
    control_isr_tick_count = 0;
    control_isr_last_timestamp_us = 0;
    control_isr_last_cycles = 0;
    control_isr_max_cycles = 0;
    current_isr_last_timestamp_us =
        static_cast<uint32_t>(esp_timer_get_time());
    current_isr_last_raw_sequence = current_raw_sequence;
    current_adc_start_frame_count = current_adc_frame_count;
    current_adc_start_update_count = current_adc_update_count;
    current_adc_start_dma_callback_count = current_adc_dma_callback_count;
    rotor_publish_count = 0;
    rotor_last_published_timestamp_us = 0;
    rotor_last_publish_interval_us = 0;
    rotor_max_publish_interval_us = 0;
    encoder_read_attempt_failure_count = 0;
    encoder_bus_reset_count = 0;
    encoder_last_read_duration_us = 0;
    encoder_max_read_duration_us = 0;
    bus_sense_last_duration_us = 0;
    bus_sense_max_duration_us = 0;
    control_timer_running = true;
    esp_err_t error = mcpwm_timer_start_stop(control_timer,
        MCPWM_TIMER_START_NO_STOP);
    if(error != ESP_OK)
    {
        control_timer_running = false;
        ESP_LOGE(TAG, "启动 MCPWM FOC 控制定时器失败: %d",
            static_cast<int>(error));
        return false;
    }
    control_timer_started = true;
    return true;
}

/**
 * @brief 停止 MCPWM FOC 控制定时器并等待当前 ISR 退出
 *
 * @return 停止成功时返回 true
 */
static bool stop_control_timer()
{
    control_timer_running = false;
    bool stop_successful = true;
    if(control_timer && control_timer_started)
    {
        esp_err_t error = mcpwm_timer_start_stop(control_timer,
            MCPWM_TIMER_STOP_EMPTY);
        if(error != ESP_OK)
        {
            stop_successful = false;
            ESP_LOGE(TAG, "停止 MCPWM FOC 控制定时器失败: %d",
                static_cast<int>(error));
        }
        control_timer_started = false;
    }

    while(control_isr_in_progress)
    {
        taskYIELD();
    }
    return stop_successful;
}

/**
 * @brief FOC 硬件测试控制任务
 *
 * @param argument FreeRTOS 任务参数
 *
 * @note 任务每 1 ms 读取 AS5600 并向 Topic 发布转子样本，运行低速机械速度
 *       环得到 q 轴电流目标。ADC1 连续采样任务提供电流原始值，MCPWM
 *       ISR 发布电流样本并运行 foc_core::core_loop_from_isr()；MCPWM ISR
 *       在 CPU1，当前任务在 CPU0。
 */
static void foc_control_task_entry(void *argument)
{
    foc_topic_access &topics = *control_topics;
    TickType_t last_wake_tick = xTaskGetTickCount();
    int64_t task_start_us = esp_timer_get_time();
    bool motor_started = false;
    bool test_finished = false;
    bool start_error_reported = false;
    bool speed_filter_valid = false;
    float filtered_speed_feedback_rad_s = 0.0f;
    uint32_t last_speed_filter_timestamp_us = 0;
    uint32_t speed_over_limit_count = 0;
    float commanded_speed_target_rad_s = 0.0f;
    float speed_integral_a = 0.0f;
    float closed_loop_start_angle_rad = 0.0f;
    float closed_loop_min_angle_rad = 0.0f;
    float closed_loop_max_angle_rad = 0.0f;
    float closed_loop_max_speed_rad_s = 0.0f;
    bool closed_loop_motion_stats_valid = false;
    int64_t motor_start_timestamp_us = 0;
    int64_t last_log_us = task_start_us;

    while(true)
    {
        uint32_t next_iteration_count = control_task_iteration_count;
        control_task_iteration_count = next_iteration_count + 1;
        control_task_stage = 1;
        control_task_stage_timestamp_us = static_cast<uint32_t>(
            esp_timer_get_time());
        uint32_t sequence = ++sample_sequence;
        int64_t current_timestamp_us = esp_timer_get_time();
        phase_current_sample current{};
        bool current_valid = read_phase_currents(
            current.phase_a_a,
            current.phase_b_a,
            current.phase_c_a);
        current.sequence = sequence;
        current.timestamp_us = static_cast<uint32_t>(current_timestamp_us);
        current.valid = current_valid;
        control_task_stage = 2;
        control_task_stage_timestamp_us = static_cast<uint32_t>(
            esp_timer_get_time());

