BGzEroll/foc_v3p_esp32/user_lib/drivers/foc/esp32_hardware_test.cpp
        control_task_stage = 3;
        control_task_stage_timestamp_us = static_cast<uint32_t>(
            esp_timer_get_time());
        int64_t rotor_timestamp_us = esp_timer_get_time();
        rotor_sample rotor{};
        bool rotor_valid = read_rotor_sample(rotor_timestamp_us,
            sequence,
            rotor);

        if(rotor_valid)
        {
            float speed_feedback_rad_s =
                static_cast<float>(MOTOR_ROTOR_DIRECTION) *
                rotor.mechanical_velocity_rad_s;
            if(!speed_filter_valid)
            {
                filtered_speed_feedback_rad_s = speed_feedback_rad_s;
                last_speed_filter_timestamp_us = rotor.timestamp_us;
                speed_filter_valid = true;
            }
            else if(static_cast<uint32_t>(rotor.timestamp_us -
                last_speed_filter_timestamp_us) >=
                VELOCITY_ESTIMATION_PERIOD_US)
            {
                filtered_speed_feedback_rad_s +=
                    SPEED_FILTER_ALPHA *
                    (speed_feedback_rad_s -
                        filtered_speed_feedback_rad_s);
                last_speed_filter_timestamp_us = rotor.timestamp_us;
            }
            speed_feedback_for_log_rad_s = filtered_speed_feedback_rad_s;
            rotor_read_success_count++;
        }
        else
        {
            rotor_read_failure_count++;
        }
        control_task_stage = 4;
        control_task_stage_timestamp_us = static_cast<uint32_t>(
            esp_timer_get_time());

        if(!control_timer_running)
        {
            read_bus_sense();
        }
        current.timestamp_us = static_cast<uint32_t>(
            esp_timer_get_time());
        if(rotor_valid)
        {
            rotor.timestamp_us = static_cast<uint32_t>(
                esp_timer_get_time());
        }
        if(!control_timer_running)
        {
            topics.current.publish(current);
        }
        bool rotor_published = false;
        if(rotor_valid)
        {
            control_task_stage = 5;
            control_task_stage_timestamp_us = static_cast<uint32_t>(
                esp_timer_get_time());
            rotor_published = topics.rotor.publish(rotor);
            control_task_stage = 6;
            control_task_stage_timestamp_us = static_cast<uint32_t>(
                esp_timer_get_time());
            if(rotor_published)
            {
                uint32_t publish_timestamp_us = static_cast<uint32_t>(
                    esp_timer_get_time());
                if(rotor_publish_count > 0)
                {
                    rotor_last_publish_interval_us =
                        publish_timestamp_us -
                        rotor_last_published_timestamp_us;
                    if(rotor_last_publish_interval_us >
                        rotor_max_publish_interval_us)
                    {
                        rotor_max_publish_interval_us =
                            rotor_last_publish_interval_us;
                    }
                }
                rotor_last_published_timestamp_us = publish_timestamp_us;
                rotor_publish_count++;
            }
        }

        int64_t now_us = esp_timer_get_time();
        if(!motor_started && !test_finished &&
            now_us - task_start_us >=
            static_cast<int64_t>(AUTO_START_DELAY_MS) * 1000)
        {
            if(current_valid && rotor_valid)
            {
                control_task_stage = 7;
                control_task_stage_timestamp_us = static_cast<uint32_t>(
                    esp_timer_get_time());
                foc_result result = motor.enable();
                control_task_stage = 8;
                control_task_stage_timestamp_us = static_cast<uint32_t>(
                    esp_timer_get_time());
                if(result == foc_result::OK)
                {
                    ESP_LOGI(TAG,
                        "准备进入 AS5600 速度闭环: FOC=%d Hz, target=%.2f rad/s, "
                        "q_limit=%.3f A, kick=%.3f A/%d ms",
                        static_cast<int>(FOC_CONTROL_FREQUENCY_HZ),
                        CLOSED_LOOP_TARGET_MECHANICAL_SPEED_RAD_S,
                        CLOSED_LOOP_MAX_Q_CURRENT_A,
                        STARTUP_KICK_Q_CURRENT_A,
                        static_cast<int>(STARTUP_KICK_DURATION_MS));
                    if(start_control_timer())
                    {
                        control_task_stage = 9;
                        control_task_stage_timestamp_us = static_cast<uint32_t>(
                            esp_timer_get_time());
                        motor_started = true;
                        commanded_speed_target_rad_s = 0.0f;
                        speed_integral_a = 0.0f;
                        closed_loop_start_angle_rad =
                            rotor.mechanical_angle_rad;
                        closed_loop_min_angle_rad =
                            rotor.mechanical_angle_rad;
                        closed_loop_max_angle_rad =
                            rotor.mechanical_angle_rad;
                        closed_loop_max_speed_rad_s = 0.0f;
                        closed_loop_motion_stats_valid = true;
                        motor_start_timestamp_us = now_us;
                    }
                    else
                    {
                        motor.disable();
                        test_finished = true;
                        ESP_LOGE(TAG, "FOC 控制定时器启动失败，已停机");
                    }
                }
                else if(!start_error_reported)
                {
                    ESP_LOGE(TAG, "开启 FOC 失败: %d",
                        static_cast<int>(result));
                    start_error_reported = true;
                }
            }
        }

        foc_result loop_result = static_cast<foc_result>(
            control_isr_last_result);
        if(motor_started)
        {
            if(rotor_valid && closed_loop_motion_stats_valid)
            {
                if(rotor.mechanical_angle_rad < closed_loop_min_angle_rad)
                {
                    closed_loop_min_angle_rad = rotor.mechanical_angle_rad;
                }
                if(rotor.mechanical_angle_rad > closed_loop_max_angle_rad)
                {
                    closed_loop_max_angle_rad = rotor.mechanical_angle_rad;
                }
                float absolute_speed_rad_s = absolute_value(
                    rotor.mechanical_velocity_rad_s);
                if(absolute_speed_rad_s > closed_loop_max_speed_rad_s)
                {
                    closed_loop_max_speed_rad_s = absolute_speed_rad_s;
                }
            }
            if(speed_filter_valid &&
                absolute_value(filtered_speed_feedback_rad_s) >
                    MOTOR_MAX_MECHANICAL_SPEED_RAD_S)
            {
                if(speed_over_limit_count <
                    SPEED_OVERSPEED_CONFIRMATION_COUNT)
                {
                    speed_over_limit_count++;
                }
            }
            else
            {
                speed_over_limit_count = 0;
            }
            if(control_isr_fault)
            {
                uint8_t fault_result = control_isr_fault_result;
                uint32_t isr_ticks = control_isr_tick_count;
                uint32_t diagnostic_now_us = static_cast<uint32_t>(
                    esp_timer_get_time());
                stop_control_timer();
                motor.disable();
                motor_started = false;
                test_finished = true;
                ESP_LOGE(TAG,
                    "FOC ISR 失败，已停机: result=%d, ticks=%lu, "
                    "rotor_ok=%lu, rotor_fail=%lu, rotor_age=%lu us, "
                    "rotor_pub=%lu interval=%lu max_interval=%lu us, "
                    "current_age=%lu us, adc_seq=%lu/%lu/%lu, adc_frames=%lu, "
                    "adc_errors=%lu, adc_channels=%lu/%lu/%lu/%lu, "
                    "adc_commit=%lu/%lu age=%lu us, "
                    "adc_update=%lu/%lu stage=%lu, "
                    "adc_dma=%lu +%lu age=%lu us core=%u, "
                    "adc_delta=%lu/%lu/%lu, isr_core=%u, "
                    "snapshot_retry=%lu, "
                    "rotor=%u/%u age=%lu us, "
                    "task=%lu stage=%lu age=%lu us, "
                    "encoder_fail=%lu reset=%lu read=%lu/%lu us, "
                    "bus_read=%lu/%lu us, "
                    "adc_frame=%lu, isr_cycles=%lu/%lu",
                    static_cast<int>(fault_result),
                    static_cast<unsigned long>(isr_ticks),
                    static_cast<unsigned long>(rotor_read_success_count),
                    static_cast<unsigned long>(rotor_read_failure_count),
                    static_cast<unsigned long>(
                        diagnostic_now_us -
                            rotor_last_published_timestamp_us),
                    static_cast<unsigned long>(rotor_publish_count),
                    static_cast<unsigned long>(rotor_last_publish_interval_us),
                    static_cast<unsigned long>(rotor_max_publish_interval_us),
                    static_cast<unsigned long>(
                        control_isr_fault_current_age_us),
                    static_cast<unsigned long>(
                        control_isr_fault_raw_sequence),
                    static_cast<unsigned long>(
                        control_isr_fault_locked_sequence),
                    static_cast<unsigned long>(
                        control_isr_fault_unlocked_sequence),
                    static_cast<unsigned long>(current_adc_frame_count),
                    static_cast<unsigned long>(current_adc_read_error_count),
                    static_cast<unsigned long>(
                        control_isr_fault_sample_count),
                    static_cast<unsigned long>(control_isr_fault_a_count),
                    static_cast<unsigned long>(control_isr_fault_b_count),
                    static_cast<unsigned long>(
                        control_isr_fault_invalid_count),
                    static_cast<unsigned long>(
                        control_isr_fault_commit_count),
                    static_cast<unsigned long>(
                        control_isr_fault_commit_sequence),
                    static_cast<unsigned long>(
                        control_isr_fault_commit_age_us),
                    static_cast<unsigned long>(
                        control_isr_fault_update_count),
                    static_cast<unsigned long>(
                        control_isr_fault_no_pair_count),
                    static_cast<unsigned long>(
                        control_isr_fault_update_stage),
                    static_cast<unsigned long>(
                        control_isr_fault_dma_callback_count),
                    static_cast<unsigned long>(
                        control_isr_fault_dma_delta),
                    static_cast<unsigned long>(
                        control_isr_fault_dma_age_us),
                    static_cast<unsigned int>(
                        control_isr_fault_dma_core_id),
                    static_cast<unsigned long>(
                        control_isr_fault_frame_delta),
                    static_cast<unsigned long>(
                        control_isr_fault_update_delta),
                    static_cast<unsigned long>(
                        control_isr_fault_dma_delta),
                    static_cast<unsigned int>(control_isr_core_id),
                    static_cast<unsigned long>(
                        control_isr_fault_snapshot_retry_count),
                    static_cast<unsigned int>(
                        control_isr_fault_rotor_peek_ok),
                    static_cast<unsigned int>(
                        control_isr_fault_rotor_valid),
                    static_cast<unsigned long>(
                        control_isr_fault_rotor_age_us),
                    static_cast<unsigned long>(
                        control_isr_fault_task_iteration_count),
                    static_cast<unsigned long>(control_isr_fault_task_stage),
                    static_cast<unsigned long>(
                        control_isr_fault_task_stage_age_us),
                    static_cast<unsigned long>(
                        encoder_read_attempt_failure_count),
                    static_cast<unsigned long>(encoder_bus_reset_count),
                    static_cast<unsigned long>(encoder_last_read_duration_us),
                    static_cast<unsigned long>(encoder_max_read_duration_us),
                    static_cast<unsigned long>(bus_sense_last_duration_us),
                    static_cast<unsigned long>(bus_sense_max_duration_us),
                    static_cast<unsigned long>(current_adc_last_frame_size),
                    static_cast<unsigned long>(control_isr_last_cycles),
                    static_cast<unsigned long>(control_isr_max_cycles));
                ESP_LOGE(TAG,
                    "控制任务诊断: iteration=%lu stage=%lu stage_age=%lu us",
                    static_cast<unsigned long>(control_task_iteration_count),
                    static_cast<unsigned long>(control_task_stage),
                    static_cast<unsigned long>(
                        diagnostic_now_us - control_task_stage_timestamp_us));
            }
            else if(rotor_valid && !rotor_published)
            {
                stop_control_timer();
                motor.disable();
                motor_started = false;
                test_finished = true;
                ESP_LOGE(TAG, "发布转子样本失败，已停机");
            }
            else if(speed_over_limit_count >=
                SPEED_OVERSPEED_CONFIRMATION_COUNT)
            {
                stop_control_timer();
                motor.disable();
                motor_started = false;
                test_finished = true;
                ESP_LOGE(TAG,
                    "机械速度超限，已停机: speed=%.3f rad/s",
                    filtered_speed_feedback_rad_s);
            }
            else
            {
                if(now_us - motor_start_timestamp_us >=
                    static_cast<int64_t>(CONTROL_TARGET_HANDOFF_DELAY_MS) *
                        1000)
                {
                    float speed_target_step_rad_s =
                        CLOSED_LOOP_SPEED_RAMP_RAD_S2 *
                        SPEED_CONTROL_PERIOD_S;
                    if(commanded_speed_target_rad_s <
                        CLOSED_LOOP_TARGET_MECHANICAL_SPEED_RAD_S)
                    {
                        commanded_speed_target_rad_s +=
                            speed_target_step_rad_s;
                        if(commanded_speed_target_rad_s >
                            CLOSED_LOOP_TARGET_MECHANICAL_SPEED_RAD_S)
                        {
                            commanded_speed_target_rad_s =
                                CLOSED_LOOP_TARGET_MECHANICAL_SPEED_RAD_S;
                        }
                    }
                    else if(commanded_speed_target_rad_s >
                        CLOSED_LOOP_TARGET_MECHANICAL_SPEED_RAD_S)
                    {
                        commanded_speed_target_rad_s -=
                            speed_target_step_rad_s;
                        if(commanded_speed_target_rad_s <
                            CLOSED_LOOP_TARGET_MECHANICAL_SPEED_RAD_S)
                        {
                            commanded_speed_target_rad_s =
                                CLOSED_LOOP_TARGET_MECHANICAL_SPEED_RAD_S;
                        }
                    }

                    bool startup_kick_active = now_us -
                        motor_start_timestamp_us <
                        static_cast<int64_t>(STARTUP_KICK_DURATION_MS) * 1000;
                    float target_q_current_a = startup_kick_active ?
                        STARTUP_KICK_Q_CURRENT_A :
                        calculate_speed_q_current_target(
                                commanded_speed_target_rad_s,
                                filtered_speed_feedback_rad_s,
                                speed_integral_a);
                    foc_target closed_loop_target{};
                    closed_loop_target.timestamp_us =
                        static_cast<uint32_t>(now_us);
                    closed_loop_target.mode = foc_control_mode::CURRENT;
                    closed_loop_target.d_axis_current_a = 0.0f;
                    closed_loop_target.q_axis_current_a = target_q_current_a;
                    control_task_stage = 10;
                    control_task_stage_timestamp_us = static_cast<uint32_t>(
                        esp_timer_get_time());
                    foc_result target_result = motor.set_target(
                        closed_loop_target);
                    control_task_stage = 11;
                    control_task_stage_timestamp_us = static_cast<uint32_t>(
                        esp_timer_get_time());
                    if(target_result != foc_result::OK)
                    {
                        stop_control_timer();
                        motor.disable();
                        motor_started = false;
                        test_finished = true;
                        ESP_LOGE(TAG, "更新速度闭环目标失败，已停机: %d",
                            static_cast<int>(target_result));
                    }
                }
            }
        }

        if(motor_started && now_us - task_start_us >=
            static_cast<int64_t>(TEST_RUN_DURATION_MS) * 1000)
        {
            stop_control_timer();
            motor.disable();
            motor_started = false;
            test_finished = true;
            float closed_loop_angle_span_rad =
                closed_loop_motion_stats_valid ?
                closed_loop_max_angle_rad - closed_loop_min_angle_rad : 0.0f;
            float closed_loop_angle_delta_rad =
                closed_loop_motion_stats_valid ?
                rotor.mechanical_angle_rad - closed_loop_start_angle_rad :
                0.0f;
            ESP_LOGI(TAG,
                "硬件测试时长到达，已自动停机: ticks=%lu, "
                "isr_cycles=%lu/%lu, angle_delta=%.3f rad, "
                "angle_span=%.3f rad, max_speed=%.3f rad/s",
                static_cast<unsigned long>(control_isr_tick_count),
                static_cast<unsigned long>(control_isr_last_cycles),
                static_cast<unsigned long>(control_isr_max_cycles),
                closed_loop_angle_delta_rad,
                closed_loop_angle_span_rad,
                closed_loop_max_speed_rad_s);
        }

        if(!control_timer_running && now_us - last_log_us >=
            static_cast<int64_t>(LOG_PERIOD_MS) * 1000)
        {
            foc_snapshot snapshot{};
            bool snapshot_valid = topics.snapshot.peek(snapshot, 0);
            int32_t logged_bus_sense_mv = bus_sense_read_valid ?
                bus_sense_voltage_mv : -1;
            if(snapshot_valid)
            {
                ESP_LOGI(TAG,
                    "state=%d loop=%d Ia=%.3f Ib=%.3f Ic=%.3f "
                    "Id=%.3f Iq=%.3f Iq_target=%.3f speed_target=%.3f "
                    "speed_feedback=%.3f encoder_speed=%.3f "
                    "encoder_angle=%.3f electrical_angle=%.3f "
                    "fault=0x%lx bus_pin=%d mV",
                    static_cast<int>(snapshot.state),
                    static_cast<int>(loop_result),
                    snapshot.phase_a_current_a,
                    snapshot.phase_b_current_a,
                    snapshot.phase_c_current_a,
                    snapshot.i_d_a,
                    snapshot.i_q_a,
                    snapshot.target_i_q_a,
                    commanded_speed_target_rad_s,
                    filtered_speed_feedback_rad_s,
                    rotor.mechanical_velocity_rad_s,
                    rotor.mechanical_angle_rad,
                    snapshot.electrical_angle_rad,
                    static_cast<unsigned long>(snapshot.fault_flags),
                    static_cast<int>(logged_bus_sense_mv));
            }
            else
            {
                ESP_LOGI(TAG,
                    "等待 FOC 快照: current=%d rotor=%d bus_pin=%d mV",
                    current_valid ? 1 : 0,
                    rotor_valid ? 1 : 0,
                    static_cast<int>(logged_bus_sense_mv));
            }
            last_log_us = now_us;
        }

