BGzEroll/foc_v3p_esp32/user_lib/drivers/foc/esp32_hardware_test.cpp
        vTaskDelayUntil(&last_wake_tick,
            pdMS_TO_TICKS(CONTROL_TASK_PERIOD_MS));
        control_task_stage = 12;
        control_task_stage_timestamp_us = static_cast<uint32_t>(
            esp_timer_get_time());
    }
}

/**
 * @brief 输出 FOC 运行状态的低优先级诊断任务
 *
 * @param argument FreeRTOS 任务参数
 *
 * @note 该任务只在任务上下文读取快照并打印，不参与控制计算。将串口
 *       输出与控制任务分离，避免日志阻塞 AS5600 采样和 ADC 读取。
 */
static void foc_status_logger_task_entry(void *argument)
{
    (void)argument;
    bool logger_reference_valid = false;
    float logger_reference_angle_rad = 0.0f;
    uint32_t logger_reference_timestamp_us = 0;
    while(true)
    {
        if(control_timer_running && control_topics && !control_isr_fault)
        {
            foc_snapshot snapshot{};
            rotor_sample rotor{};
            bool snapshot_valid = control_topics->snapshot.peek(snapshot, 0);
            bool rotor_valid = control_topics->rotor.peek(rotor, 0);
            if(snapshot_valid && rotor_valid)
            {
                uint32_t now_us = static_cast<uint32_t>(
                    esp_timer_get_time());
                float window_speed_rad_s =
                    rotor.mechanical_velocity_rad_s;
                if(logger_reference_valid)
                {
                    uint32_t window_time_us = rotor.timestamp_us -
                        logger_reference_timestamp_us;
                    if(window_time_us > 0 &&
                        window_time_us < SPEED_LOG_WINDOW_MAX_US)
                    {
                        window_speed_rad_s =
                            (rotor.mechanical_angle_rad -
                                logger_reference_angle_rad) /
                            (static_cast<float>(window_time_us) * 1.0e-6f);
                    }
                }
                logger_reference_angle_rad = rotor.mechanical_angle_rad;
                logger_reference_timestamp_us = rotor.timestamp_us;
                logger_reference_valid = true;
                float window_speed_rpm = window_speed_rad_s *
                    RAD_PER_SECOND_TO_RPM;
                uint32_t rotor_age_us = now_us - rotor.timestamp_us;
                ESP_LOGI(TAG,
                    "运行状态: Iq=%.3f/%.3f A, speed_raw=%.3f rad/s, "
                    "speed_window=%.3f rad/s(%.1f rpm), "
                    "speed_feedback=%.3f rad/s, angle=%.3f rad, "
                    "electrical=%.3f rad, rotor_seq=%lu age=%lu us, "
                    "enc_reject=%lu, isr=%lu/%lu",
                    snapshot.i_q_a,
                    snapshot.target_i_q_a,
                    rotor.mechanical_velocity_rad_s,
                    window_speed_rad_s,
                    window_speed_rpm,
                    speed_feedback_for_log_rad_s,
                    rotor.mechanical_angle_rad,
                    snapshot.electrical_angle_rad,
                    static_cast<unsigned long>(rotor.sequence),
                    static_cast<unsigned long>(rotor_age_us),
                    static_cast<unsigned long>(
                        encoder_rejected_sample_count.load(
                            std::memory_order_relaxed)),
                    static_cast<unsigned long>(control_isr_last_cycles),
                    static_cast<unsigned long>(control_isr_max_cycles));
            }
        }
        vTaskDelay(pdMS_TO_TICKS(LOG_PERIOD_MS));
    }
}

/* ---- esp32_hardware_test 公共 API ---- */

/**
 * @brief 初始化 ESP32 V3P 单电机 FOC 硬件测试
 *
 * @note 该测试会先保持 EN 低电平，校准电流零点，使用 0.4 V 固定电压矢量
 *       对齐 AS5600，然后延时 1 s 自动进入低速 AS5600 速度闭环。目标机械
 *       速度为 5 rad/s，正常 q 轴电流限制为 0.05 A，启动阶段使用 0.05 A
 *       助推 100 ms，运行 60 s 后自动停机。电流环由 MCPWM ISR 驱动，
 *       AS5600 仍由任务读取。没有硬件故障输入，保护依靠电流采样、
 *       机械速度检查和 foc_core 软件限幅。
 */
void esp32_hardware_test::init()
{
    if(module_initialized)
    {
        return;
    }

    if(!initialize_power_output() || !initialize_adc())
    {
        disable_power_stage();
        ESP_LOGE(TAG, "硬件测试初始化失败，保持驱动器关闭");
        return;
    }

    i2c_result encoder_result = encoder_device.init();
    if(encoder_result != i2c_result::OK)
    {
        disable_power_stage();
        ESP_LOGE(TAG, "AS5600 I2C 初始化失败: %d",
            static_cast<int>(encoder_result));
        return;
    }

    encoder_result = encoder_bus.reset();
    if(encoder_result != i2c_result::OK)
    {
        ESP_LOGW(TAG, "AS5600 I2C 总线初始复位失败: %d",
            static_cast<int>(encoder_result));
    }

    if(!initialize_control_timer())
    {
        disable_power_stage();
        ESP_LOGE(TAG, "FOC 控制定时器初始化失败，保持驱动器关闭");
        return;
    }

    if(!calibrate_current_offsets())
    {
        disable_power_stage();
        ESP_LOGE(TAG, "电流零点校准失败，保持驱动器关闭");
        return;
    }

    float initial_encoder_angle_rad = 0.0f;
    if(!read_encoder_angle(initial_encoder_angle_rad))
    {
        disable_power_stage();
        ESP_LOGE(TAG, "AS5600 初始角度读取失败，保持驱动器关闭");
        return;
    }
    ESP_LOGI(TAG, "AS5600 初始机械角度: %.5f rad",
        initial_encoder_angle_rad);

    float electrical_zero_offset_rad = 0.0f;
    if(!align_sensor(electrical_zero_offset_rad))
    {
        disable_power_stage();
        ESP_LOGE(TAG, "传感器对齐失败，保持驱动器关闭");
        return;
    }

    foc_config config{};
    config.pole_pairs = MOTOR_POLE_PAIRS;
    config.rotor_direction = MOTOR_ROTOR_DIRECTION;
    config.electrical_zero_offset_rad = electrical_zero_offset_rad;
    config.control_period_s = FOC_CONTROL_PERIOD_S;
    config.bus_voltage_v = MOTOR_BUS_VOLTAGE_V;
    config.voltage_limit_v = MOTOR_VOLTAGE_LIMIT_V;
    config.max_phase_current_a = MOTOR_MAX_PHASE_CURRENT_A;
    config.d_axis_pi.kp = CURRENT_PI_KP;
    config.d_axis_pi.ki = CURRENT_PI_KI;
    config.d_axis_pi.integral_limit = CURRENT_PI_INTEGRAL_LIMIT_V;
    config.q_axis_pi.kp = CURRENT_PI_KP;
    config.q_axis_pi.ki = CURRENT_PI_KI;
    config.q_axis_pi.integral_limit = CURRENT_PI_INTEGRAL_LIMIT_V;

    foc_result result = motor.init(config, create_foc_output());
    if(result != foc_result::OK)
    {
        disable_power_stage();
        ESP_LOGE(TAG, "FOC 核心初始化失败: %d", static_cast<int>(result));
        return;
    }

    static foc_topic_access topic_access = motor.topics();
    control_topics = &topic_access;
    foc_topic_access &topics = *control_topics;
    uint32_t initial_sequence = ++sample_sequence;
    int64_t current_timestamp_us = esp_timer_get_time();
    phase_current_sample current{};
    current.sequence = initial_sequence;
    current.timestamp_us = static_cast<uint32_t>(current_timestamp_us);
    current.valid = read_phase_currents(current.phase_a_a,
        current.phase_b_a,
        current.phase_c_a);
    int64_t rotor_timestamp_us = esp_timer_get_time();
    rotor_sample rotor{};
    bool rotor_valid = read_rotor_sample(rotor_timestamp_us,
        initial_sequence,
        rotor);
    if(!current.valid || !rotor_valid ||
        !topics.current.publish(current) ||
        !topics.rotor.publish(rotor))
    {
        motor.disable();
        ESP_LOGE(TAG, "初始传感器样本无效，保持驱动器关闭");
        return;
    }

    foc_target target{};
    target.timestamp_us = static_cast<uint32_t>(esp_timer_get_time());
    target.mode = foc_control_mode::CURRENT;
    target.d_axis_current_a = 0.0f;
    target.q_axis_current_a = 0.0f;
    result = motor.set_target(target);
    if(result != foc_result::OK)
    {
        motor.disable();
        ESP_LOGE(TAG, "设置初始电流目标失败: %d", static_cast<int>(result));
        return;
    }

    ESP_LOGI(TAG,
        "硬件测试就绪: PWM=%d Hz, FOC=%d Hz, I2C=%d Hz, bus=%.1f V, "
        "shunt=%.3f ohm, gain=%.1f, "
        "current_scale=%.4f A/mV, closed_loop_speed=%.2f rad/s, "
        "q_limit=%.3f A, auto_start=%d",
        static_cast<int>(PWM_FREQUENCY_HZ),
        static_cast<int>(FOC_CONTROL_FREQUENCY_HZ),
        static_cast<int>(I2C_SPEED_HZ),
        MOTOR_BUS_VOLTAGE_V,
        CURRENT_SHUNT_RESISTOR_OHM,
        CURRENT_AMPLIFIER_GAIN,
        CURRENT_SCALE_A_PER_MV,
        CLOSED_LOOP_TARGET_MECHANICAL_SPEED_RAD_S,
        CLOSED_LOOP_MAX_Q_CURRENT_A,
        1);

    BaseType_t task_result = xTaskCreatePinnedToCore(
        foc_control_task_entry,
        "foc_control",
        4096,
        nullptr,
        CONTROL_TASK_PRIORITY,
        nullptr,
        CONTROL_TASK_CORE);
    if(task_result != pdPASS)
    {
        motor.disable();
        ESP_LOGE(TAG, "创建 FOC 控制任务失败");
        return;
    }

    task_result = xTaskCreatePinnedToCore(
        foc_status_logger_task_entry,
        "foc_status",
        3072,
        nullptr,
        tskIDLE_PRIORITY + 1,
        nullptr,
        CONTROL_TASK_CORE);
    if(task_result != pdPASS)
    {
        ESP_LOGW(TAG, "创建 FOC 状态诊断任务失败");
    }

    module_initialized = true;
}
